[
{"id": "167", "title": "Soul Eater NOT!", "author": "Atsushi Ohkubo", "image": "https://global-img.manga-up.com/oU9/en/manga_main/167.webp?h=8sH2dbW61F4_oKngZhkcQw&e=1659139200", "description": "Ding-dong! DEAD-dong! Class is about to begin, and you don't want to be late on your first day of school! Join Tsugumi Harudori in the NOT class at Death Weapon Meister Academy, a school dedicated to training transforming Weapons like Tsugumi and the Meisters who will wield them. Many NOT (Normally Overcome Target) students aspire to join the elite EAT (Especially Advantaged Talent) class, but it may take Tsugumi some time to find her confidence-and a partner-at this crazy school!", "url": "https://global.manga-up.com/manga/167", "next_update": "Next Update : July 25, 2022", "genres": ["Action"], "last_ch_name": "Final Chapter", "last_ch_id": 15356},
{"id": "46", "title": "Reborn as a Feudal Lord Gathering a Talented Elite So This Land Can Thrive by Employing My Past Life Experiences as an Overworked White-Collar Worker", "author": "Susumu Sorano, rikko, Kousei Moriga, Eishi Hayama", "image": "https://global-img.manga-up.com/gbL/en/manga_main/46.webp?h=nnKwWB1sRtcvShc7sBMfLw&e=1659139200", "description": "When I woke up after collapsing from overwork working for a black company, I had been reborn as the son of a minor feudal lord in a different world. Our lands were attacked by monsters, I lost my new parents, and the people fleed... In order to survive, I must gather a talented elite so this land can thrive by employing my knowledge from my past life as a overworked white-collar worker! A story of managing a fiefdom in another world starting from zero citizens!", "url": "https://global.manga-up.com/manga/46", "next_update": "Next Update : July 25, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 3.3", "last_ch_id": 3788},
{"id": "57", "title": "Reincarnation of the Unrivalled Time Mage: The Underachiever at the Magic Academy Turns Out to Be the Strongest Mage Who Controls Time!", "author": "Shusui Hazuki, Yui Sakuma, Arutera", "image": "https://global-img.manga-up.com/OKa/en/manga_main/57.webp?h=9xczEDW-hR9IF-GA1QthCQ&e=1659139200", "description": "There are always 16 heroes. Amongst them the Darkness Hero, Shion, the strongest hero in history. Shion has only one thing he believes in, his party members. However, those girls he believed in cruelly betrayed him. Is there a way for Shion to overcome his deep pain and keep on living?", "url": "https://global.manga-up.com/manga/57", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 15.1", "last_ch_id": 16352},
{"id": "38", "title": "Reincarnated as the Daughter of the Legendary Hero and the Queen of Spirits", "author": "Matsuura, Yutaka Ohhori, keepout", "image": "https://global-img.manga-up.com/cXp/en/manga_main/38.webp?h=u4HPSaAamXbuTc_k5-YT2g&e=1659139200", "description": "\"I became the spirit of elements when I reincarnated?!\"\n\nEllen is a young girl reincarnated from modern-day Japan as a half-spirit. Her father, Rovel, is the legendary hero who saved the kingdom, and her mother, Origin, is the primordial queen and ruler of all spirits. Furthermore, she herself has the overpowered ability to manipulate the elements.\n\nWhile looking absolutely adorable, this perfect little girl will fall back on her past life's knowledge and the power of the spirits to protect her precious family!", "url": "https://global.manga-up.com/manga/38", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 3.1", "last_ch_id": 3075},
{"id": "6", "title": "Revolutionary Restart for The Blue Rose Princess", "author": "Roku Kaname, FUTABA HADUKI, Hanna Tsukuda, Syo Yuduki", "image": "https://global-img.manga-up.com/ebM/en/manga_main/6.webp?h=GjqhS7VOd2pHG0Xut4b-wQ&e=1659139200", "description": "The proud Kingdom of Hileland celebrates its founding on the night of The Star Festival.\n\nDrowning in unfulfilled love, Queen Alicia had long neglected her duties to the country. That night, a man leading a rebellion storms into the castle and stabs her in the chest. She meets her end...or does she?\n\nAlicia wakes up and discovers she has been sent back to when she was 10 years old with the memories of her past life intact! This miracle turns into a nightmare when she runs into Clovis...the man who killed her!\n\nFollow the story of the Blue Rose Princess, who gets a second chance at life to change her fate!", "url": "https://global.manga-up.com/manga/6", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 21.3", "last_ch_id": 324},
{"id": "104", "title": "PandoraHearts", "author": "Jun Mochizuki", "image": "https://global-img.manga-up.com/nxf/en/manga_main/104.webp?h=isohvxuZgKIhQfMkppMnWA&e=1659139200", "description": "The air of celebration surrounding fifteen-year-old Oz Vessalius's coming-of-age ceremony quickly turns to horror when he is condemned for a sin about which he knows nothing. He is thrown into an eternal, inescapable prison known as the Abyss from which there is no escape. There, he meets a young girl named Alice, who is not what she seems. Now that the relentless cogs of fate have begun to turn, do they lead only to crushing despair for Oz, or is there some shred of hope for him to grasp on to?", "url": "https://global.manga-up.com/manga/104", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Retrace:CIV -7", "last_ch_id": 8016},
{"id": "21", "title": "Reincarnated as an Eight-Year-Old Apostle of the Gods", "author": "Ezogingitune, Ataru Akinashi, Mo", "image": "https://global-img.manga-up.com/ec7/en/manga_main/21.webp?h=1ru9Oi0YBJmCP7ppVfIf3A&e=1659139200", "description": "Adelphus, the most powerful sage, was defeated by the Calamity Beast, an enemy of mankind, and was taken to heaven. However, he learns that the beast of evil will return in time, and was reborn as an 8-year-old boy named Will. The tale of the peerless Warriors begins now!", "url": "https://global.manga-up.com/manga/21", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 18.2", "last_ch_id": 1546},
{"id": "129", "title": "Saki", "author": "Ritz Kobayashi", "image": "https://global-img.manga-up.com/oGp/en/manga_main/129.webp?h=KFb_LNQuD9ousD0UWuaPqw&e=1659139200", "description": "Saki's never been a big fan of mahjong. A lifetime of being forced to play with family at holidays (and losing her money as a consequence...) has left a foul taste for the game in her mouth. When she's convinced, though, to play a game with her classmates, she discovers that not only has fending off her family left her with an uncanny ability for the game but, more surprisingly, that it can even be fun!\n\nIs this revelation enough to cleanse Saki's distaste for the game? Can her classmates convince her to join their club, or is there just too much baggage to make it worth her while?", "url": "https://global.manga-up.com/manga/129", "next_update": "Next Update : July 25, 2022", "genres": ["Comedy", "Game"], "last_ch_name": "Hand 212", "last_ch_id": 11385},
{"id": "159", "title": "One Room of Happiness", "author": "Hakuri", "image": "https://global-img.manga-up.com/oR-/en/manga_main/159.webp?h=EQ-p7n8azyzWQ_8u83MlqA&e=1659139200", "description": "That day, she was abducted. But to her, that abduction was a ray of hope -- the beginning of a new life. The girl promises to marry her abductor, and the abductor offers plenty of \"happiness.\" This is the story of an abductor and his victim... How could it be so warm?", "url": "https://global.manga-up.com/manga/159", "next_update": "Next Update : July 1, 2022", "genres": ["Suspense"], "last_ch_name": "Chapter 48 -4", "last_ch_id": 14444},
{"id": "22", "title": "Noble Reincarnation ~Born Blessed, So I’ll Obtain Ultimate Power~", "author": "Nazuna Miki, Hisui Hanashima, Kentaro Kurimoto, Kyo", "image": "https://global-img.manga-up.com/2q/en/manga_main/22.webp?h=6YtZZpK1rBNlg6yh53qGPQ&e=1659139200", "description": "Noa, reincarnated as the ultimate noble, overflows with knowledge and cheat skills as he aims to win servants in this fantasy world!!", "url": "https://global.manga-up.com/manga/22", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 21.1", "last_ch_id": 17354},
{"id": "130", "title": "No Matter How I Look at It, It's You Guys' Fault I'm Not Popular!", "author": "Nico Tanigawa", "image": "https://global-img.manga-up.com/oJ3/en/manga_main/130.webp?h=Q4o9lTUMCgRnIfbK00uhLw&e=1659139200", "description": "Tomoko Kuroki naturally assumed she'd be popular when she got to high school...but then cold, hard reality swooped in for the attack! Turns out all the popularity points she's racked up in her video game dating sims are worth squat in real life, and Tomoko's far from prepared to navigate high school! How can she possibly hope to impress her classmates when she can't even talk to them?! A new high-school heroine is born (maybe?)!", "url": "https://global.manga-up.com/manga/130", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Fail 177", "last_ch_id": 11786},
{"id": "166", "title": "Soul Eater", "author": "Atsushi Ohkubo", "image": "https://global-img.manga-up.com/oTj/en/manga_main/166.webp?h=YlR9qUlorwoPbGxMqNJf3g&e=1659139200", "description": "Maka is a weapon meister, determined to turn her partner, a living scythe named Soul Eater, into a powerful death scythe - the ultimate weapon of Death himself! Charged with the task of collecting and devouring the tainted souls of ninety-nine humans and one witch, Maka and her fellow meisters strive to master their weapons as they face off against the bizarre and dangerous minions of the underworld. But the meisters' own personal quirks may prove a bigger obstacle than any sultry enchantress!", "url": "https://global.manga-up.com/manga/166", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Final Chapter -3", "last_ch_id": 15292},
{"id": "77", "title": "Nina is Plotting Daddy's Death", "author": "Mujirushi Shimazaki, Kitora", "image": "https://global-img.manga-up.com/OOa/en/manga_main/77.webp?h=6fgEdKvqPXwWNu2q9kq3XA&e=1659139200", "description": "Reiji Takahashi is a Special Operations Agent. While in the middle of sweeping through a criminal group's warehouse, he finds Nina,  a victim of a trafficking ring dealing in child assassins named \"Dolls.\" One thing led to another, and he ends up being assigned with caring for the young assassin (Who, coincidentally, is aiming for his life).\n\nCan Reiji, a man with absolutely zero experience with children, become a proper father to this tiny assassin and teach her how to lead a normal life? Find out in this heartwarming childcare comedy between a \"hard-boiled\" operative and his adoptive(?) daughter!", "url": "https://global.manga-up.com/manga/77", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 21.2", "last_ch_id": 16399},
{"id": "112", "title": "Sekirei", "author": "Sakurako Gokurakuin", "image": "https://global-img.manga-up.com/o5Z/en/manga_main/112.webp?h=gbIzk9Hka0OfMcnd3AQCpw&e=1659139200", "description": "Minato Sahashi is a loser who's failed his college placement exams two years running. But just as he's contemplating giving up and moving back in with his mom, a chance encounter changes his life forever! Enter Musubi, a girl who literally falls into Minato's life! Musubi is a Sekirei, a mysterious being caught up in a game in which only one of her kind can be left standing. But in order to be victorious in this contest, she needs to find her fated partner...and guess who fits the bill??\n\nCaught up in a battle he barely understands, can Minato survive the \"Sekirei Project\" and emerge victorious? Either way, with his buxom new cohort by his side, his life will certainly never be the same!\nTogether forever. I'll be by your side!", "url": "https://global.manga-up.com/manga/112", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 11", "last_ch_id": 9268},
{"id": "9", "title": "My Unexpected Marriage", "author": "Mashimesa Emoto, Anjue Hino, Machi", "image": "https://global-img.manga-up.com/eP0/en/manga_main/9.webp?h=pLiSD8xzhohLiT5032xJ_g&e=1659139200", "description": "\"Starting today, you are my wife.\"\nTo pay off the debt of her once-wealthy family, the beautiful Leyfa is sold off as \"a rare item that will bring prosperity\" and taken to a distant empire. There she met the handsome, but sickly head of the family, Shin Yu. Living the imperial life and suddenly married to a cool, mysterious husband, Leyfa uses her cooking prowess to become the \"ideal married couple\"! ", "url": "https://global.manga-up.com/manga/9", "next_update": "Next Update : July 25, 2022", "genres": [], "last_ch_name": "Chapter 10.6", "last_ch_id": 524},
{"id": "19", "title": "My Not-So-Fair Lady is Doomed! (But Not If I Can Help It)", "author": "Kiri Komori, Too Mizuguchi, Momoshiki", "image": "https://global-img.manga-up.com/2H/en/manga_main/19.webp?h=8N96CpIaXnySlSr46jLmlg&e=1659139200", "description": "I, Vincent, a butler of a count’s daughter, suddenly remembered that the world I'm currently living in is part of an Otome game I’ve played in my past life! On top of that, my beloved lady is the villainess who will end up dying a violent death…?! What the hell! I’ll DEFINITELY save my lady from her bad endings!!! A peppy, isekai comedy, where the butler, Vincent “I Love My Lady” Serenade (a love interest), sprints around snapping all of his dear villainess’ death flags.", "url": "https://global.manga-up.com/manga/19", "next_update": "Next Update : July 27, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 9.3", "last_ch_id": 15973},
{"id": "158", "title": "YanOta: The Delinquent and the Otaku", "author": "Yumi Hoshimi", "image": "https://global-img.manga-up.com/oRm/en/manga_main/158.webp?h=95hoeCpcdn_DHexkO22n4w&e=1659139200", "description": "Saeki Kazuko is your average adult otaku who also happens to dislike men and delinquents. Yet her neighbor, Aikawa Ryuou, is a delinquent grade schooler who won't leave her alone! Her peaceful otaku days are in danger, but is there a reason for it?", "url": "https://global.manga-up.com/manga/158", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 45 -1", "last_ch_id": 17294},
{"id": "7", "title": "Wrapping up the Imperial Harem", "author": "Mahiro Kobayakawa, You Kajika", "image": "https://global-img.manga-up.com/I/en/manga_main/7.webp?h=GUZJ7Z68Za8O3V31soxmsQ&e=1659139200", "description": "Her favorite novel was set in the imperial harem. Now she gets to solve its mysteries! When Xiao Ling took a job at a bookstore, she had no idea she'd be working with her favorite author. Arriving at the palace she'd only read about in stories, Xiao Ling finds not the seasoned authoress she expected, but...the Crown Prince, Ryuhou?!", "url": "https://global.manga-up.com/manga/7", "next_update": "Next Update : July 1, 2022", "genres": ["Suspense"], "last_ch_name": "Chapter 11.4", "last_ch_id": 16035},
{"id": "75", "title": "Working seems Pointless After the Hero Labeled Me as a Coward and Kicked Me From His Party", "author": "JYOGESAYUU, Gaou, Sii Umeno", "image": "https://global-img.manga-up.com/eip/en/manga_main/75.webp?h=kNSdsYXw1xIYcdBBPo2CjQ&e=1659139200", "description": "A martial artist called Nicola, who specializes in techniques considered foul by many, is kicked from the Hero's party. Feeling betrayed, he vows to never work again.\nNonetheless, Nicola's older sister, Satella, has other plans for him, appointing Nicola as the teacher of the class composed of the weakest alumni in the Shanoa Academy. There, he meets Alice, a tender and lovely elf girl.\nIn a world where a person's worth is determined by their muscles, Alice ranks among the lowest, and to change herself, she enlists Nicola's aid to learn from him a fighting style in which... anything goes!\nThis is a battle fantasy story of rising to the top through clever but underhanded tactics! ", "url": "https://global.manga-up.com/manga/75", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 6.3", "last_ch_id": 5576},
{"id": "91", "title": "Vermeil in Gold: The Failing Student and the Strongest Scourge Plunge Into the World of Magic", "author": "Kouta Amana, Youko Umezu", "image": "https://global-img.manga-up.com/ORz/en/manga_main/91.webp?h=fbOwW5CRQ6i6HBOooK5S0w&e=1659139200", "description": "Alto, an aspiring magician, is about to repeat a grade when he accidentally summons the demon Vermeil, which was sealed in a book Alto found by chance. Not only does Vermeil hold an ancient power capable of bringing about the end of the world, she’s also quite naughty! A traditional fantasy story about a struggling magician and his powerful familiar begins with their fateful meeting!", "url": "https://global.manga-up.com/manga/91", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "School Life"], "last_ch_name": "Chapter 23.5", "last_ch_id": 17092},
{"id": "131", "title": "Val x Love", "author": "Ryosuke Asakura", "image": "https://global-img.manga-up.com/oJq/en/manga_main/131.webp?h=3QVre1SlI5G-fDQOjDWaEg&e=1659139200", "description": "High schooler Takuma Akutsu is terrified of human contact and just wants to live a quite life. Too bad he doesn't have a choice in the matter when nine Valkyrie sisters come barging into his home! They've tasked him with raising their level to fight off the monsters threatening humanity--and how will he do that, exactly...? By gettin' down & dirty to the max!!!", "url": "https://global.manga-up.com/manga/131", "next_update": "Next Update : July 25, 2022", "genres": ["Action"], "last_ch_name": "Chapter 61 -1", "last_ch_id": 11933},
{"id": "82", "title": "Trying Out Alchemy After Being Fired as an Adventurer!: Frontier Settling? No Problem, Leave It to Me!", "author": "Sazameki Sasaki, Kengo Konno, Shishitou, Alex", "image": "https://global-img.manga-up.com/OPH/en/manga_main/82.webp?h=fSCS4DJRW8XbDgX_rUYlRw&e=1659139200", "description": "Craft is an adventurer with the magician's crest. However, he has absolutely no talent as a magician! One day, after having been fired from yet another party due to his lack of latent, he had his crest changed at the recommendation of a crest inspector. His new crest turned out to be the legendary \"Twilight Alchemist\"! Craft, the weakest magi turned strongest alchemist, now sets out to slay monsters! ...Or not! Instead, he'll be settling the frontier! Unaware of his potential, the legendary alchemist's peaceful life starts here!", "url": "https://global.manga-up.com/manga/82", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 17.3", "last_ch_id": 6116},
{"id": "101", "title": "Trinity of the Royal Palace", "author": "Esora Amaichi", "image": "https://global-img.manga-up.com/8Cx/en/manga_main/101.webp?h=qaUiR8I9bEk04PRAObgEew&e=1659139200", "description": "In the Kingdom of Wardell Ceram, a realm rich in flowers and trees, the charming duo of Luca and Sylvain live outside the law. As the Wolf Claws, they are a chivalrous thieves who target those nobles who commit evil deeds. Their deeds bring them to the attention of the Kingdom's Princess, who wants to recruit them for a very special task. A romantic comedy about love that transcends class!", "url": "https://global.manga-up.com/manga/101", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 24.2", "last_ch_id": 7585},
{"id": "69", "title": "Uglymug, Epicfighter", "author": "Ryo Hiromatsu, Osamu Kozuki", "image": "https://global-img.manga-up.com/ejY/en/manga_main/69.webp?h=XBs1jE74MP7Y-fob-pndJw&e=1659139200", "description": "His looks are -255, touching girls causes him pain, and sexual acts will literally tear him apart. Just what can our ex-salesman Shigeru get in the other world in exchange for such inconveniences...? This is an epic tale of one very ugly, but ridiculously strong man!", "url": "https://global.manga-up.com/manga/69", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 32.3", "last_ch_id": 5276},
{"id": "132", "title": "Toilet-bound Hanako-kun", "author": "AidaIro", "image": "https://global-img.manga-up.com/oK4/en/manga_main/132.webp?h=mSqId6xyGTR66wBFOa7yJg&e=1659139200", "description": "At Kamome Academy, rumors abound about the school's Seven Mysteries, one of which is Hanako-san. Said to occupy the third stall of the third floor girls' bathroom in the old school building, Hanako-san grants any wish when summoned. Nene Yashiro, an occult-loving high school girl who dreams of romance, ventures into this haunted bathroom...but the Hanako-san she meets there is nothing like she imagined! Kamome Academy's Hanako-san...is a boy!", "url": "https://global.manga-up.com/manga/132", "next_update": "Next Update : July 27, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Spook 68 -1", "last_ch_id": 12156},
{"id": "128", "title": "Today's Cerberus", "author": "Ato Sakurai", "image": "https://global-img.manga-up.com/oGB/en/manga_main/128.webp?h=BSPg2w9aals0Hks7wcZZVg&e=1659139200", "description": "As a young boy, Chiaki Mikado had an encounter with an unusual, three-headed puppy, and as a consequence of a bite from that dog, he lost a piece of his soul. Now a teenager, he finds himself unable to enjoy anything, but the three-headed dog is back in human form -- or more accurately forms -- to fix all that!\n\nTurns out that the three heads of the mythical guardian to the gates of the underworld are actually unique individuals, and each a pretty young girl at that! With his new roommate(s) leading the charge, can Chiaki experience the happiness that has so long eluded him?", "url": "https://global.manga-up.com/manga/128", "next_update": "Next Update : July 26, 2022", "genres": ["Comedy"], "last_ch_name": "Side Story -2", "last_ch_id": 11166},
{"id": "30", "title": "The World is Full of Monsters, So I Want to Live as I Wish", "author": "yosshaa！, Ralsan, koruse", "image": "https://global-img.manga-up.com/6X/en/manga_main/30.webp?h=X-_FCJUdcHz5_q3tKeEzQw&e=1659139200", "description": "\"You have acquired experience points. Kudo Kazuto has risen to Level 1,\" echoes through Kazuto's mind after he runs over a mysterious dog on his way home from work. The next morning, he awakens to a changed world, full of vicious monsters. The world now features a game-like system of levels and skills, alongside danger at every turn. Will Kazuto be able to survive by leveling up and taking advantage of the special skill he acquired the previous night? His survival adventure begins now!", "url": "https://global.manga-up.com/manga/30", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 1.4", "last_ch_id": 2463},
{"id": "95", "title": "The Witch's Servant and the Demon Lord's Horns", "author": "Mochi", "image": "https://global-img.manga-up.com/8B-/en/manga_main/95.webp?h=ZdYA5mlKKe2jGJXITAhrWw&e=1659139200", "description": "Arsenio, the loyal servant of a witch, receives an order from his master, and this one won't be easy. He is to retrieve a horn from the Demon Lord himself! But once he infiltrates the Demon Lord's castle, his expectations are immediately subverted: the Demon Lord appears nothing more than a mascot, and Arsenio catches him harassing a young, shapely girl...?!\nWill Arsenio be able to squeeze out a victory? Or is something else getting the squeeze first?", "url": "https://global.manga-up.com/manga/95", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 1.3", "last_ch_id": 7023},
{"id": "15", "title": "The Villainess' Butler: Death Flag Destroyer at Your Service", "author": "Hiironoame, Shobu, Yuichi Murakami", "image": "https://global-img.manga-up.com/ebk/en/manga_main/15.webp?h=BW0ELy1BEFLq79_YJpbkSQ&e=1659139200", "description": "A reincarnation story with a twist! I, Cyril, have been reborn in a new world and pledged myself to save Lady Sophia, the villainess of an otome game, from the many horrible fates that await her! I've raised her to be a proper young lady, keeping her from turning to the dark side...but apparently, she's developed feelings for me. And now the game's heroine has appeared, putting all I've accomplished at risk. Still, as her all-knowing butler, I will defy fate and ensure milady's happiness!", "url": "https://global.manga-up.com/manga/15", "next_update": "Next Update : July 27, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 19.3", "last_ch_id": 16284},
{"id": "140", "title": "The Unrivaled Reincarnated Sage of Another World -The Strongest in Another World Through Game Knowledges-", "author": "Shinkoshoto, Miso Sato, Kaito Shibano", "image": "https://global-img.manga-up.com/O_Q/en/manga_main/140.webp?h=JcYHlY7aYTOamWzDT8H3Bg&e=1659139200", "description": "Due to an unfortunate death, a young man reincarnates under the name Eld in a world very similar to the VRMMO that he played before his passing. However, this world he found himself in didn't even know what basic skills were! As the only person with knowledge beyond the populace, Eld sets off on a journey as a level 1 novice to job change into the strongest class in the world, Sage!", "url": "https://global.manga-up.com/manga/140", "next_update": "Next Update : July 25, 2022", "genres": ["Action"], "last_ch_name": "Chapter 9 -2", "last_ch_id": 12817},
{"id": "87", "title": "The Unholy Paladin", "author": "Fumikaru Nishijima, Ann Siranui, momoshiki", "image": "https://global-img.manga-up.com/8Ak/en/manga_main/87.webp?h=0UvS7AGClz_dLg8ckv8mzw&e=1659139200", "description": "Kai, a young Dark Knight who comes from a household of elite Dark-job holders, decided to pursue even greater strength. One day, he saved the Princess who was being attacked by a monster, which ended up being the trigger for him to join an academy specialized in teaching Holy jobs. Together with Millia, his childhood friend as well as a Paladin, his little sister Chloe the Necromancer, and Princess Shel, who later becomes his tutor, their thrilling academy life begins. Despite having a body so incompatible with Holy magic that he almost passes out whenever he uses it, he is resolved to endure all hardships, for he aspires to become the polar opposite of the strongest Dark Knight: the kingdom's strongest Royal Paladin!", "url": "https://global.manga-up.com/manga/87", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 3.3", "last_ch_id": 6521},
{"id": "144", "title": "The Strongest Wizard Becomes a Countryside Guard After Taking an Arrow to the Knee", "author": "Ezogingitune, Masaki Ayano, TEDDY", "image": "https://global-img.manga-up.com/P16/en/manga_main/144.webp?h=hCohlVdhYUC3vUkuSTf4LA&e=1659139200", "description": "Alfred Rindt is the strongest wizard. After taking a cursed arrow to the knee, he just wants some peace and quiet to heal. But, being a famous hero has its downsides. Everyone in the royal capital is demanding his assistance! Alfred decides he needs to get away from the hustle and bustle of the big city, so he takes a job as a village guard in the countryside. Will Alfred finally get the rest he so desires, or will the countryside prove to be just as lively as the city he left behind?", "url": "https://global.manga-up.com/manga/144", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Comedy"], "last_ch_name": "Chapter 3 -3", "last_ch_id": 13241},
{"id": "81", "title": "The Strongest Tank’s Labyrinth Raids -A Tank with a Rare 9999 Resistance Skill Got Kicked from the Hero’s Party-", "author": "Ryuta Kijima, Makoto Kisaragi, Sando", "image": "https://global-img.manga-up.com/89u/en/manga_main/81.webp?h=sY99l0NfxhzoQJH3-Hcddg&e=1659139200", "description": "Rud is a tank of the Hero's Party and is said to have the highest defense ever in history. The party often does labyrinth raids, but to Rud, it means more than just a raid. To cure his beloved sister's illness, he is in search for the wish-granting treasure that might be hidden in those labyrinths. But one day, the arrogant hero kicks him from the party after an unsuccessful raid attempt, blaming it on his skills whose effects he is still unaware of. Without nowhere else to go and nothing to do, he decides to return to his hometown, where his sister is waiting. On his way there, he saves a girl who was being attacked by a monster. Unexpectedly, this girl has an extremely rare skill called \"Appraisal\". Thanks to her skill, Rud is able to discover the truth behind his unknown skills, which turn out to be very powerful skills. With a defense of 9999 and powerful skills, thus begins the adventure of the strongest tank, Rud!", "url": "https://global.manga-up.com/manga/81", "next_update": "Next Update : July 27, 2022", "genres": ["Action"], "last_ch_name": "Chapter 10.5", "last_ch_id": 5996},
{"id": "41", "title": "The Strongest Swordsman Has Zero Equipment Slots, but He Can Equip up to 9999 Items if It’s (Cute) Cursed Equipment", "author": "Mochimaru Sakaki, Daisuke Takashima, Yunohito", "image": "https://global-img.manga-up.com/gap/en/manga_main/41.webp?h=3qYNLix6Lv0rgKxL-SRiWw&e=1659139200", "description": "In a world where your value is determined by the amount of equipment slots you're born with, our young protagonist Noroa, who dreams of becoming an adventurer has... zero equipment slots! However, he's able to equip 9999 items only if they are cursed?!\nHis adventure begins a fateful day after meeting a mysterious doll and acquiring a cheat-like cursed sword!", "url": "https://global.manga-up.com/manga/41", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 9.1", "last_ch_id": 3403},
{"id": "27", "title": "The Strongest Sage: The Story of a Talentless Man Who Mastered Magic and Became the Best", "author": "Shinkoshoto, Friendly Land, Huuka Kazabana", "image": "https://global-img.manga-up.com/ODt/en/manga_main/27.webp?h=So5wYDjIjRcD7geFox9XCg&e=1659139200", "description": "Despite being born with the crest that's most unsuited for battle, Gaius devoted his life to researching magic, and became the world's strongest mage. Still, he yearns for more formidable enemies, even though he's painfully aware of how powerless he would be against them. And so, he goes in search of allies.\nBut who would be fitting for the strongest battle mage?!\nMeet Iris, the Dragon of Darkness in a young girl's body; Yuril, the Sorceress of Annihilation, known as the strongest in the kingdom; Reuter, the Demigod of the Blade, and his skills worthy of being praised in legends.\nJoin these four as they go through battles that transcend imagination!!", "url": "https://global.manga-up.com/manga/27", "next_update": "Next Update : July 27, 2022", "genres": ["Action"], "last_ch_name": "Chapter 5.5", "last_ch_id": 2031},
{"id": "92", "title": "The Strongest Middle-Aged Hunter Goes to Another World: This Time, He Wants to Have a Simple Life", "author": "Syuichi Tsukisima, Nagi Isawa, matsuryu", "image": "https://global-img.manga-up.com/XBM/en/manga_main/92.webp?h=WpkF8pQtfmjcgTQ01RbPHA&e=1659139200", "description": "Despite his age, Jin is the strongest hunter. In his never-ending quest to earn enough money to feed his two cute housemates, he takes up his greatsword and goes out to hunt every day.\n \nOne day, while chasing an onigiri he accidentally dropped, he trips and falls into a hole... that takes him to another world?!\n \nMany strange things await him on the other side... Elf girls? Legendary dragons? Oh, and he's still the strongest, even in these new worlds...?!", "url": "https://global.manga-up.com/manga/92", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 3.2", "last_ch_id": 6867},
{"id": "42", "title": "The Strongest Hero: Envoy of Darkness -Betrayed by His Comrades, the Strongest Hero Joins Forces with the Strongest Monster-", "author": "Meguru Seto, Yuri Kimura, Johndee", "image": "https://global-img.manga-up.com/859/en/manga_main/42.webp?h=jqYHUcpwl7qzEqnoRIVasg&e=1659139200", "description": "There are always 16 heroes. Amongst them the Darkness Hero, Shion, the strongest hero in history. Shion has only one thing he believes in, his party members. However, those girls he believed in cruelly betrayed him. Is there a way for Shion to overcome his deep pain and keep on living?", "url": "https://global.manga-up.com/manga/42", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 2.4", "last_ch_id": 3486},
{"id": "123", "title": "The Royal Tutor", "author": "Higasa Akai", "image": "https://global-img.manga-up.com/oEQ/en/manga_main/123.webp?h=wduX22p9ktNIFWRKvkJZcQ&e=1659139200", "description": "Accepting the post of royal tutor at the court of the king of Granzreich, Heine Wittgenstein is a little professor with a big job ahead of him! Each of the kingdom's four princes has a rather distinct personality. Does their diminutive new instructor have what it takes to lay down some learning? It's a comedy of educational proportions!", "url": "https://global.manga-up.com/manga/123", "next_update": "Next Update : July 26, 2022", "genres": ["Comedy"], "last_ch_name": "Final Chapter 103 -2", "last_ch_id": 10592},
{"id": "45", "title": "The Reincarnated Prince Becomes an Alchemist and Brings Prosperity to His Country", "author": "Rui Tsukiyo, S.Kosugi, Arata Shindou", "image": "https://global-img.manga-up.com/OI5/en/manga_main/45.webp?h=QO_OJI4cyP8CzpnSOp4oNA&e=1659139200", "description": "Reborn as the third prince of a tiny and insignificant country, Hero happens to learn the forbidden-yet-powerful art of alchemy. Combined with his knowledge from modern-day Japan, Hero's abilities grow beyond what anyone in his world could fathom! With his newly-acquired powers, he’ll bring his country back from the verge of extinction...!\n\nA combination of modern-day knowledge and alchemy to turn a weak little country into a prosperous nation!", "url": "https://global.manga-up.com/manga/45", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 8.5", "last_ch_id": 3778},
{"id": "147", "title": "The Necromancer Maid", "author": "Mujirushi Shimazaki, Hama", "image": "https://global-img.manga-up.com/oNL/en/manga_main/147.webp?h=rDsEGOGJkhbJE95H6NsftQ&e=1659139200", "description": "A young girl -Chloe La Forêt- is alone and unconscious in the Corpse Forest. Well, it's too bad. At least the monsters will finish her off within a few days.\nExcept this girl gets rescued in the nick of time. And the man who finds her? He's her new boss, Alchemist Kurakazu Rintarou. Chloe has a knack for cleaning and thus becomes his housekeeper. But she quickly reveals another hidden talent of hers - necromancy! Watch as this story of science and fiction unfold under one roof.", "url": "https://global.manga-up.com/manga/147", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 10", "last_ch_id": 13478},
{"id": "165", "title": "The Mercenary and the Novelist", "author": "Asovu Minami, Nachiyo Murayama, TAKOLEGS", "image": "https://global-img.manga-up.com/8hS/en/manga_main/165.webp?h=NMeJ4OqpowuKsUAGmV6QqQ&e=1659139200", "description": "With the advent of the transcontinental railroad, smoke from steam locomotives veils the cities and mercenaries are a thing of the past.\n\nSword, a mercenary, is down on his luck when he accepts a job from the bestselling lady novelist, Verderon. They set out on a journey to a dangerous, uncharted mountain... Only to be caught up in a conspiracy between church and state?!\n\nA tale of iron swords and typewriters!", "url": "https://global.manga-up.com/manga/165", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 2.3", "last_ch_id": 17117},
{"id": "50", "title": "The Lesser Irregular Returns From the Demon World", "author": "Tasuro, Yasuyuki Torikai, Karu", "image": "https://global-img.manga-up.com/ehc/en/manga_main/50.webp?h=uOtlasWSr0TmXuzbLKucqA&e=1659139200", "description": "Hiroto Domori is a seemingly weakling Irregular who doesn’t have any magical or spiritual powers. But what most people don’t know is that he just got back from the demon world and is the world's strongest demon killer. \n \nThis \"weak\" demon killer goes up against an unrivaled enemy who attacks innocent people.\n \nThe battle between lessers and the strongest!", "url": "https://global.manga-up.com/manga/50", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 2.2", "last_ch_id": 4015},
{"id": "55", "title": "The Legendary Dragon-armored Knight Wants to Live a Normal Life In the Countryside", "author": "Tuck, Tomoyuki Maru, Hana Amano", "image": "https://global-img.manga-up.com/86w/en/manga_main/55.webp?h=0xDCoA_lUMgQpZGr_jk8aA&e=1659139200", "description": "Elm, the legendary Dragon-Armored Knight who once sealed six demon kings and saved the world countless times... is now a humble villager in the countryside!  But what happens when he \"accidentally\" uses his OP skills...?", "url": "https://global.manga-up.com/manga/55", "next_update": "Next Update : July 27, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 23.3", "last_ch_id": 4362},
{"id": "16", "title": "The Lady Likes a Nerd over Princes", "author": "Yuma Tosaka, Carpaccio Noyama, Kurodeko", "image": "https://global-img.manga-up.com/2E/en/manga_main/16.webp?h=bi0_7BD6P871l7JZqX3tEw&e=1659139200", "description": "Cheerful and free-spirited Sharina first met the studious and somber Riol when he saved her from mortal danger, and she fell in love with him at first sight. Using the adage, “the way to a man’s heart is through his stomach,” Sharina makes Riol homemade food in hopes it will get him to fall in love with her too. But instead, the delicious aroma catches the interest of the first prince of their country, Leonardo! Fascinated by how she’s unlike any other girl he’s met before, the prince claims Sharina as his own. Ever the arrogant narcissist, Leonardo can’t fathom how anyone could turn him down and his persistence crosses into the realm of harassment. Riol rescues Sharina, but at the cost of incurring the prince’s wrath! Can Sharina and Riol figure out a way to get the pompous prince to leave them alone?!", "url": "https://global.manga-up.com/manga/16", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 16.2", "last_ch_id": 17170},
{"id": "28", "title": "The Isekai Returnee is Too OP for the Modern World", "author": "Arata Shiraishi, Koban Sameda, TaKaYa Ki", "image": "https://global-img.manga-up.com/OEC/en/manga_main/28.webp?h=bihHZOXIqiG4vgDw3fESqQ&e=1659139200", "description": "Morishita Daiki became a hero after being summoned to another world. After skillfully striking down the Demon Lord, he returned to Japan. Daiki, with his strength concealed, was living a tranquil day-to-day life. However, apparitions and those with special powers run rampant in this seemingly-normal world. A supernatural school-battle epic rarely seen in the modern era unfolds in the shadows!! A story about an unbelievably strong hero returning to the modern era after his adventures in another world!", "url": "https://global.manga-up.com/manga/28", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 10.3", "last_ch_id": 2126},
{"id": "152", "title": "The Impregnable Demon King’s Castle and the Expelled Black Mage of the Hero’s Party", "author": "Hozumi Mitaka, j1 Kaido, Aoi Yumitori, Roku Hiraishi, Yuuhi", "image": "https://global-img.manga-up.com/P2l/en/manga_main/152.webp?h=8OSRX98kAU9HNl2GvcdL6Q&e=1659139200", "description": "In the present era, adventurers, demons, heroes, and demon lord, are no longer occupations that put one's lives at stake. With the world at peace, it is an era where conquering dungeons has been transformed into entertainment. Adventurers and monsters are able to fight with a substitute body made of magic, popularizing dungeon conquests with no deaths. Having lost his job, the “Black Mage” Remme struggled with finding another party until one day a beautiful woman appeared before him telling she had a job for him.", "url": "https://global.manga-up.com/manga/152", "next_update": "Next Update : July 27, 2022", "genres": ["Action"], "last_ch_name": "Chapter 5 -4", "last_ch_id": 13776},
{"id": "153", "title": "The Ice Guy and His Cool Female Colleague", "author": "Miyuki Tonogaya", "image": "https://global-img.manga-up.com/oQP/en/manga_main/153.webp?h=sJH3ATFfwU4Qfw0WsMlA7Q&e=1659139200", "description": "Himuro-kun is a living descendant of the Snow Woman from Japanese folklore. But anytime he's around his eccentric yet kind colleague, Fuyutsuki-san, he totally freezes up! Despite the snowstorm of love that rages on in his heart, and her complete cluelessness, will he take a step forward or stay frozen in place?", "url": "https://global.manga-up.com/manga/153", "next_update": "Next Update : July 25, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 23", "last_ch_id": 13859},
{"id": "70", "title": "The Greatest Magicmaster's Retirement Plan - The Alternative -", "author": "Izushiro, Karu Yoneshiro, MIYUKIRURIA", "image": "https://global-img.manga-up.com/ONX/en/manga_main/70.webp?h=UhSSDlYj48ILiOJijmqVbw&e=1659139200", "description": "Since he was young, he has been on the frontlines fighting against demons. Active Rank #1, the strongest magician in the world, Alusu is now 16 years old and wishes to retire to a peaceful life. However, the military will not let him go so easily. The military negotiated with Alusu to hide his identity and enroll in a magic academy as a normal student. What will come of Alusu’s retirement plan?", "url": "https://global.manga-up.com/manga/70", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "School Life"], "last_ch_name": "Chapter 19.1", "last_ch_id": 5349},
{"id": "146", "title": "The Greatest Demon Lord Is Reborn as a Typical Nobody", "author": "Myojin Katou, Misuho Kobota, Sao Mizuno", "image": "https://global-img.manga-up.com/oMv/en/manga_main/146.webp?h=VwkADXf6W6EK44hAVChBqQ&e=1659139200", "description": "What would happen if the mightiest being of all time reincarnates himself as Villager A?\nAs the Demon Lord, Varvatos leads a life where nobody dares intrude in his personal space. Desperate to find friends, he takes matters into his own hands and reincarnates 3000 years later as Ard Meteor, your regular nobody born in the boonies.\nBut little did he know, magic has vastly degenerated after his passing, and what was considered average magic power during his lifetime is now considered never-before-seen talent!\nIn a new life as a new abnormal, will he finally find true friendship?", "url": "https://global.manga-up.com/manga/146", "next_update": "Next Update : July 1, 2022", "genres": ["School Life"], "last_ch_name": "Chapter 9 -3", "last_ch_id": 13422},
{"id": "26", "title": "The Good Deeds of Old Adventurer Kane", "author": "huuraisan, Maho Okino, Super Zombie", "image": "https://global-img.manga-up.com/6N/en/manga_main/26.webp?h=Iv9LHUaKl4Mj7Hxih-m7SQ&e=1659139200", "description": "Meet Kane: a D-rank adventurer with nothing going for him but his kindness. He's spent the last 20 years getting by with herb-picking requests, but one day, he comes across a super rare item: The Fruit of Revival! Giving it away for not much more than pocket change, little does he know that his life is about to change...", "url": "https://global.manga-up.com/manga/26", "next_update": "Next Update : July 27, 2022", "genres": [], "last_ch_name": "Chapter 9.3", "last_ch_id": 1912},
{"id": "143", "title": "The Girl I Like Forgot Her Glasses", "author": "Koume Fujichika", "image": "https://global-img.manga-up.com/oLq/en/manga_main/143.webp?h=EBA00SWuxKsvYuXsTysjhA&e=1659139200", "description": "Kaede Komura has a huge crush on his seat partner, Mie-san. She, however, has terrible eyesight, and tends to either forget or break her glasses! Komura-kun offers her a helping hand, and as they grow closer, their feelings for each other grow too.", "url": "https://global.manga-up.com/manga/143", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Chapter 35 -2", "last_ch_id": 13186},
{"id": "60", "title": "The Genius Prince's Guide to Raising a Nation Out of Debt", "author": "Toru Toba, Mda, fal maro, Kentaro Kurimoto", "image": "https://global-img.manga-up.com/OL9/en/manga_main/60.webp?h=hOsdsfq9nWL6HP0hE-1J9g&e=1659139200", "description": "Wein, a young prince, is in charge of the politics in a weak country with no resources, human resources, or troops.\nTogether with a young girl named Ninym, who serves as his aide, Wayne shows his brilliant skills as a politician with a secret wish.\n\n\"Sell the country and get out of here\"!\nYes, Wayne's wish was to live a comfortable life in retirement!\nHowever, his plan took an unexpected turn when his subjects become to favor him making it difficult to fulfill that wish.\nThe tale of running a weak government and full of unexpected surprises, begins here!", "url": "https://global.manga-up.com/manga/60", "next_update": "Next Update : July 26, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 24", "last_ch_id": 4679},
{"id": "8", "title": "The Gender of Mona Lisa", "author": "Tsumuji Yoshimura", "image": "https://global-img.manga-up.com/__M/en/manga_main/8.webp?h=s8QVYDzC98y1GOxMEEEn9g&e=1659139200", "description": "In this world, when a person reaches 12 years of age, their body begins to change depending on the gender they wish to become. By 14, they'll complete their transition. And yet I alone, without any gender, approach my 18th spring…", "url": "https://global.manga-up.com/manga/8", "next_update": "Next Update : July 26, 2022", "genres": ["School Life"], "last_ch_name": "Chapter 37.2", "last_ch_id": 15994},
{"id": "149", "title": "The Executed Sage Who Was Reincarnated as a Lich and Started an All-Out War", "author": "Karaku Yuki, Shotarou Kunitomo, Pairan", "image": "https://global-img.manga-up.com/P1y/en/manga_main/149.webp?h=RSmmzhPwu6pxLCZhMBr4mg&e=1659139200", "description": "The Sage Dwight along with the Hero defeated the Demon Lord who plunged the world into darkness.\nHowever, they were falsely accused of becoming the next Demon Lords because of their power, and were thrown to the Death Valley to die…\nAlthough his flesh had rotten away, he lived on as a skeleton because of his grudge against the world. Dwight has vowed to turn against that broken world, and with a power that surpasses even the former Demon King, and also leading countless Skeletons he's going to start an all out war…!", "url": "https://global.manga-up.com/manga/149", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 8 -1", "last_ch_id": 13611},
{"id": "53", "title": "The Days After the Hero’s Return", "author": "Furudanuki Tsukiyono, Megane Yoshizawa, Kurumi Otono", "image": "https://global-img.manga-up.com/cY_/en/manga_main/53.webp?h=L1uAjnyy-eOvFNaJdzxiGA&e=1659139200", "description": "Kashiwagi Yuuya, a college student, was summoned to a different world as a hero. He’s had his fair share of hardships, but with the help of his faithful comrades, he defeated the Demon King and the Evil God and now returns to modern Japan.\nAnd then, everything that happened back there was supposed to become just a distant memory... But he's still the invincible hero he was on the other side, with all his spells and items?!", "url": "https://global.manga-up.com/manga/53", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 21", "last_ch_id": 17142},
{"id": "36", "title": "The Daily Life of a Middle-Aged Online Shopper in Another World", "author": "Hifumi Asakura, Yamakawa, Umiharu", "image": "https://global-img.manga-up.com/OFB/en/manga_main/36.webp?h=-wRLaxP-gz9CnwgpP36Iwg&e=1659139200", "description": "Ken'ichi, a single man in his 40s, is suddenly transferred to another world. As he navigates his way through the dangerous forests of that world, he realizes that he can use a huge online shopping site. Ken'ichi aims to use his cheat ability to live a slow life in another world!", "url": "https://global.manga-up.com/manga/36", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 13.2", "last_ch_id": 2961},
{"id": "107", "title": "The Case Study of Vanitas", "author": "Jun Mochizuki", "image": "https://global-img.manga-up.com/o3T/en/manga_main/107.webp?h=A0G6epOgoABPKlf0Ha_Isg&e=1659139200", "description": "Rumors revolving around The Book of Vanitas, a clockwork grimoire of dubious reputation, draw Noe, a young vampire in search of a friend's salvation, to Paris. What awaits him in the City of Flowers, however, is not long hours treading the pavement or rifling through dusty bookshops in search of the tome. Instead, his quarry comes to him...in the arms of a man claiming to be a vampire doctor! Thrust into a conflict that threatens the peace between humans and vampires, will Noe cast in his lot with the curious and slightly unbalanced Vanitas and his quest to save vampirekind?", "url": "https://global.manga-up.com/manga/107", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Mémoire57", "last_ch_id": 17172},
{"id": "52", "title": "The B-Class Mage of Unrivaled Speed", "author": "Ck, Shu Yamaura, Chaco Abeno", "image": "https://global-img.manga-up.com/85o/en/manga_main/52.webp?h=NjZRpZiimgtV3Fl4JEEyNQ&e=1659139200", "description": "In a world where the size of your mana pool decides your standing, Sky, who only had a meager mana pool of five, is branded a failure by his family, despite his noble lineage.\n \nHowever, one day he met a mysterious mage named Ans who imparted his unconventional wisdom onto him. He told him that true strength didn't come from how much mana you had to cast spells, but rather how fast you could fire those spells. What's more, when it came to speed, Sky was a natural.\n \nAnd so, the dropout mage, Sky, began his journey to make a big comeback!", "url": "https://global.manga-up.com/manga/52", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 22.3", "last_ch_id": 4241},
{"id": "164", "title": "The Apothecary Diaries", "author": "Natsu Hyuuga, Nekokurage, Itsuki Nanao", "image": "https://global-img.manga-up.com/oTd/en/manga_main/164.webp?h=_TRBdQ3gcPvixv7mbDpcxQ&e=1659139200", "description": "Maomao, a young woman trained in the art of herbal medicine, is forced to work as a lowly servant in the inner palace. Though she yearns for life outside its perfumed halls, she isn’t long for a life of drudgery! Using her wits to break a “curse” afflicting the imperial heirs, Maomao attracts the attentions of the handsome eunuch Jinshi and is promoted to attendant food taster. But Jinshi has other plans for the erstwhile apothecary, and soon Maomao is back to brewing potions and…solving mysteries?!", "url": "https://global.manga-up.com/manga/164", "next_update": "Next Update : July 1, 2022", "genres": ["Suspense"], "last_ch_name": "Chapter 21", "last_ch_id": 14888},
{"id": "47", "title": "The 6-Year-Old Sage Wants to Hide in the Shadows", "author": "Manimani Ononata, Ishita, Yasutaka Isegawa", "image": "https://global-img.manga-up.com/egc/en/manga_main/47.webp?h=5VIwbp8m2BL8U45tHi0aLw&e=1659139200", "description": "\"I defeated the demon king...?\" The strongest sage reincarnates as the six-year-old Eddie Radcliffe. Despite his inherited memories and magical prowess making him stronger than he ever was, he's determined to live a peaceful life. Contrary to his wishes, he's now tasked with saving the world from behind the scenes and is trusted as a ruler in the dark.", "url": "https://global.manga-up.com/manga/47", "next_update": "Next Update : July 27, 2022", "genres": ["Action"], "last_ch_name": "Chapter 14.1", "last_ch_id": 3867},
{"id": "14", "title": "The 6th Loop: I'm Finally Free of Auto Mode in this Otome Game", "author": "SORATANI REINA, Kazusa Subaru, FUTABA HADUKI", "image": "https://global-img.manga-up.com/1w/en/manga_main/14.webp?h=3jwsuAp2sALDPODBDnsfPQ&e=1659139200", "description": "Our protagonist has been reincarnated into the world of an otome game as the villainess \"Mariabell Tempest\", a noble lady with a dreadful personality. Whenever the game's heroine reaches a happy ending, Mariabell would face a bad ending involving her being disgraced, going missing, or even dying. On top of that, the enabled ‘auto-mode’ is preventing Mariabell from choosing her own decisions however and whenever she wants. But on the 6th loop of the game, the the \"auto-mode\" causing her inevitable fate finally deactivates! Now, in order to survive and live peacefully, Mariabell will have to take advantage of her knowledge and experience from the past five loops! \n\nThe manga version of the popular fantasy-otome game reincarnation novel is finally here!", "url": "https://global.manga-up.com/manga/14", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 20.1", "last_ch_id": 16253},
{"id": "43", "title": "That Second-Rate Warrior Is Now an Overpowered Mage!", "author": "kimimaro, Takuya Tashiro, Kazutomo Miya", "image": "https://global-img.manga-up.com/igh/en/manga_main/43.webp?h=ZfGdIxO6rJyZjA3mOmYssg&e=1659139200", "description": "“I need you!”\n\nLars, an adventurer warrior, was always treated as the errand boy by his party. His life changes forever when his party kicks him out, forcing him to change jobs. It is then discovered that Lars has an overwhelming talent in magic rivaling that of the “Great Sage”!\nFriends, adventure, and perhaps...love?\nA new career with abundant talent!", "url": "https://global.manga-up.com/manga/43", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 17.3", "last_ch_id": 3677},
{"id": "20", "title": "That Inferior Knight, Level 999", "author": "Arata Shiraishi, Chihiro Yamazaki, Kazutomo Miya", "image": "https://global-img.manga-up.com/eSS/en/manga_main/20.webp?h=_gih_UWzpfSeOMjaSpb6uA&e=1659139200", "description": "His father is a sage and his mother is a martial artist...  Yuan is a boy whose parents are the strongest humans in this world and they raised him making him believe he's \"weak\". However, he can pulverize giant rocks with a flick of his finger and he hunts and eats dragons, believing they're just \"lizards\". His daily life isn't normal at all!!  If you're raised by the strongest, it's only natural that you're going to be the strongest too. This is the story of a peerless boy who knows nothing of the world but he's about to shake it!! ", "url": "https://global.manga-up.com/manga/20", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 11.4", "last_ch_id": 1348},
{"id": "124", "title": "Tales of Wedding Rings", "author": "Maybe", "image": "https://global-img.manga-up.com/oEn/en/manga_main/124.webp?h=6gZ4X6Gv7GTae7liIZAYvg&e=1659139200", "description": "Satou and his best friend, Hime, have been together for as long as he can remember. So when she tells him she's going back to her home world to get married, his first thought is to follow her and crash her wedding. All goes according to plan, and with a kiss from Hime herself, Satou becomes the new groom! But unbeknownst to Satou, the man who marries Hime is destined to be a hero of immense power and save the world! Is Satou up for the challenge, or is this just too much responsibility for one high schooler to handle?!", "url": "https://global.manga-up.com/manga/124", "next_update": "Next Update : July 27, 2022", "genres": ["Action"], "last_ch_name": "Chapter 67 -1", "last_ch_id": 17919},
{"id": "66", "title": "Tales of Reincarnation in Maydare: This World's Worst Witch", "author": "Midori Yuma, Nana Natsunishi, Esora Amaichi", "image": "https://global-img.manga-up.com/ySH/en/manga_main/66.webp?h=zDI71P6_HJXJ3pmqo_znPg&e=1659139200", "description": "In the world of Maydare, where great magicians pull the strings of fate, there lived the \"Scarlet Witch.\" She was condemned as the most wicked of them all. Makia is a descendant of that fabled \"worst witch.\"\nLately, Makia has been having dreams about a high school girl named Kazuha Oda... who turned out to be the person Makia was in her previous life! However, it so happened that Kazuha was murdered by a mysterious stranger...", "url": "https://global.manga-up.com/manga/66", "next_update": "Next Update : July 25, 2022", "genres": ["Action"], "last_ch_name": "Chapter 15.2", "last_ch_id": 14972},
{"id": "160", "title": "Talentless Nana", "author": "Looseboy, Iori Furuya", "image": "https://global-img.manga-up.com/OYR/en/manga_main/160.webp?h=hYBBfr71TpKhobfEYd0BTQ&e=1659139200", "description": "An academy on an island in unnavigable waters. There, students trained tirelessly, to fight back against the enemies of humanity. The protagonist, a student newly transferred there, also sets out with the intention of eradicating all enemies of humankind. An unpredictable, intellectual suspense story of justice and evil.", "url": "https://global.manga-up.com/manga/160", "next_update": "Next Update : July 1, 2022", "genres": ["School Life", "Suspense"], "last_ch_name": "Chapter 71 -2", "last_ch_id": 17309},
{"id": "12", "title": "Sweet & Tart Boyfriend", "author": "Hoshimi SK", "image": "https://global-img.manga-up.com/XCi/en/manga_main/12.webp?h=yATyEoghKGMqmcv1n3QxYA&e=1659139200", "description": "My obstinate boyfriend always has a sharp tongue, while all the while, he pampers me. Living with a boyfriend like him fills my life to the brim with surprise and joy. A super popular tart & sweet couple Rom-Com from Twitter & Pixiv!", "url": "https://global.manga-up.com/manga/12", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 54", "last_ch_id": 781},
{"id": "88", "title": "Strongest Swordsman’s Magic Training: Reincarnated with Level 99 Stats, He Gets to Start Over from Level 1", "author": "Mugichatarou Nenjuu, Yami Satsuki, B-Ginga", "image": "https://global-img.manga-up.com/8Aw/en/manga_main/88.webp?h=cfPdmLVD-LlyOlhsBLxyRA&e=1659139200", "description": "Ragna, \"Master of Sword\", used to be the strongest swordsman. He ventured alone into the mysterious Heavenfell Tower and reached where no man had stepped before, the seventh floor... only to find the limit of his growth. \nHowever, his story is far from over. He gets reincarnated and returns to level 1...while keeping all of his level 99 stats?!", "url": "https://global.manga-up.com/manga/88", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 12.2", "last_ch_id": 16583},
{"id": "4", "title": "Strawberry Love", "author": "Irono", "image": "https://global-img.manga-up.com/O72/en/manga_main/4.webp?h=oREtK-2yPiwUrNXZYxla3A&e=1659139200", "description": "20-year-old university student, Sara Moritani, rushes back to the countryside to help her grandfather with his farm after he’s been injured. There, she meets a veteran strawberry farmer named Minori Sugiura, who is 13 years older than she is. He teaches Sara the ropes of strawberry farming. At first, she was frightened by Minori’s intimidating demeanor. But after discovering many surprising sides to him, she could feel love taking roots within her heart. On the other side of the relationship, Minori finds himself attracted to Sara. But due to their age difference, he finds it difficult to express his feelings to her...\n\nThus begins a pure and touching love story between these two awkward lovebirds. ", "url": "https://global.manga-up.com/manga/4", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 8.54", "last_ch_id": 208},
{"id": "162", "title": "My Isekai Life", "author": "Shinkoshoto, Friendly Land, Huuka Kazabana", "image": "https://global-img.manga-up.com/OY8/en/manga_main/162.webp?h=PSBVb91UYxGDqdTmqBHGCg&e=1659139200", "description": "Whether at the office or at home, corporate drone Yuji Sano works all the time. So when his home PC flashes a message about him being summoned to another world, Yuji restarts his machine...only to find that he's inadvertently accepted the summons! Now in a fantasy world far removed from paperwork and computers, Yuji has just one thing on his mind: waking up from what he thinks is a dream and getting back to the mountain of work he left behind! But this other world has other plans for Yuji, who quickly discovers his Monster Tamer character class allows him to befriend slimes! And thanks to their number, those slimes help him absorb so much magical knowledge that he gains a second character class in the blink of an eye! How will Yuji wield his power now that he's the greatest sage the realm has ever known?! And what about all that paperwork?!", "url": "https://global.manga-up.com/manga/162", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 3 -5", "last_ch_id": 14646},
{"id": "61", "title": "My Friend's Little Sister Has It in for Me!", "author": "Ghost Mikawa, Hira Hiraoka, tomari", "image": "https://global-img.manga-up.com/ei0/en/manga_main/61.webp?h=pIN2MtZ_CH_qSI1fmKK-9A&e=1659139200", "description": "“My best friend is the only one who has my spare keys, but for some reason, his little sister always sneaks into my room...”\n\nOoboshi Akiteru is a high school boy who is the very definition of ordinary. He leads an efficient life while being content with his unmemorable existence until his days are completely changed by Kohinata Iroha, the younger sister of his only best friend, Kohinata Ozuma. She pesters Akiteru daily to the point he finds himself caught up in all kinds of troublesome situations. What’s more, he meets other girls who also have attitudes that are hard to deal with!\n\nAnnoying and cute girls are the best! The popular, teenage romantic comedy begins now!", "url": "https://global.manga-up.com/manga/61", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Chapter 24.1", "last_ch_id": 16761},
{"id": "138", "title": "My First Times with Suwa-san", "author": "Yasuka Manuma", "image": "https://global-img.manga-up.com/tl6/en/manga_main/138.webp?h=ukjWv0TNxByl2rt7sS_BiA&e=1659139200", "description": "Yamanaka Suguru always viewed his \"first times\" as challenges to overcome. But when a girl suddenly confessed to him and became his girlfriend, she introduced him to countless new challenges that he's never known about.", "url": "https://global.manga-up.com/manga/138", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Challenge #12 -2", "last_ch_id": 12734},
{"id": "3", "title": "My Ex-Boyfriend Loves Boys' Love!", "author": "Mugiimo", "image": "https://global-img.manga-up.com/O6Y/en/manga_main/3.webp?h=nOiASgrWts26tpP8CKySUg&e=1659139200", "description": "I encountered my ex-boyfriend and found out he's a fudanshi (man who like BL).\n\nOne day, at a bookstore, Akado Momo ran into man in the BL doujinshi section. She was excited to encounter her first fudanshi, but on closer inspection, realized it was her ex-boyfriend, Katakura Suzuya?!\n\nJoin this depraved geek duo on their journey in this otaku comedy!", "url": "https://global.manga-up.com/manga/3", "next_update": "Next Update : July 27, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 22", "last_ch_id": 186},
{"id": "113", "title": "My Dress-Up Darling", "author": "Shinichi Fukuda", "image": "https://global-img.manga-up.com/o7z/en/manga_main/113.webp?h=6_GZsdBI3Pyh9yQJntCMUg&e=1659139200", "description": "A high school boy with a passion for traditional dolls and a talent for sewing gets roped into making cosplay outfits for one of the prettiest, most popular girls in his class! As the odd couple grows ever closer, they find themselves in ever racier situations!", "url": "https://global.manga-up.com/manga/113", "next_update": "Next Update : July 25, 2022", "genres": ["School Life"], "last_ch_name": "Chapter 38 -2", "last_ch_id": 9345},
{"id": "13", "title": "My Clueless First Friend", "author": "Taku Kawamura", "image": "https://global-img.manga-up.com/1L/en/manga_main/13.webp?h=oanhRoenpwRS7jDvnOpWfg&e=1659139200", "description": "Nishimura Akane is a black sheep in her class, and not a day passes without her classmates picking on her. But Takada Taiyou is new and has no clue why they would treat her that way. Will his straightforward nature become a ray of sunshine in Nishimura's gloomy days?\n \nLet their wholesome story bring you back to the carefree times of your youth!", "url": "https://global.manga-up.com/manga/13", "next_update": "Next Update : July 27, 2022", "genres": ["School Life"], "last_ch_name": "Chapter 104", "last_ch_id": 911},
{"id": "154", "title": "My Awkward Senpai", "author": "Makoto Kudo", "image": "https://global-img.manga-up.com/oQT/en/manga_main/154.webp?h=enhJ2EbVBAmEWyyDe0pSNg&e=1659139200", "description": "Kannawa-senpai is considered many things, but smooth is definitely not one of them. Then she meets Kamegawa, her new Kouhai. He's cute, a little nerdy, and easy to talk to. How will this awkward Senpai be able to handle these new feelings?!", "url": "https://global.manga-up.com/manga/154", "next_update": "Next Update : July 26, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 29", "last_ch_id": 16050},
{"id": "24", "title": "My Adventurer Life: I Became the Strongest Magic-Refining Sage in a New World", "author": "Shinkoshoto, Yuyu Kanna, Cut", "image": "https://global-img.manga-up.com/5a/en/manga_main/24.webp?h=_rAI4mYwP3wgcb9hmIxDHA&e=1659139200", "description": "After his tragic death, Minato was reborn in a world where Offensive Magic has not been banned. He was thrilled to see that Offensive Magic for the first time, however he couldn't help but wonder why all the magic circles are so inefficient?! After witnessing how ineffective the magic in this new world is, he decides to use knowledge from his previous, far more advanced world to improve it. Come along on Minato's quest to improve the magic of his new home! ", "url": "https://global.manga-up.com/manga/24", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 15.2", "last_ch_id": 16182},
{"id": "2", "title": "Mr. Villain's Day Off", "author": "Yuu Morikawa", "image": "https://global-img.manga-up.com/yfv/en/manga_main/2.webp?h=Scsxt7qQgoFvTXjzDHk1kw&e=1659139200", "description": "An Evil Organization from another planet is trying to take over Earth. An extraterrestrial from that organization named the \"General\" tirelessly fights against Earth's defenders every single day in a battle of life and death! \n\nHowever, today is his day off.", "url": "https://global.manga-up.com/manga/2", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 48", "last_ch_id": 15945},
{"id": "125", "title": "Monthly Girls' Nozaki-kun", "author": "Izumi Tsubaki", "image": "https://global-img.manga-up.com/oEt/en/manga_main/125.webp?h=eFVI5cRftkxdPm8XYZM-6w&e=1659139200", "description": "To the eyes of high school student Chiyo Sakura, classmate Umetarou Nozaki--brawny of build and brusque of tongue--is a dreamboat! When Chiyo finally works up the courage to tell Nozaki how she feels about him, she knows rejection is on the table...but getting recruited as a manga-ka's assistant?! Never in a million years!\n\nBut for someone who makes a living drawing sweet girly romances, Nozaki-kun is a little slow on the uptake when it comes to matters of the heart in reality. And so Chiyo's daily life of manga making and heartache begins!", "url": "https://global.manga-up.com/manga/125", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Issue 108", "last_ch_id": 15914},
{"id": "33", "title": "Living With My Brother's Wife", "author": "Kuzushiro", "image": "https://global-img.manga-up.com/842/en/manga_main/33.webp?h=_f1GMgVc1DV7V6S4OO_k9A&e=1659139200", "description": "Kishibe Shino, a high school student. 17 years old.\nHer parents died, and then six months ago, so did her older brother, her only remaining blood relative.\nNow she lives with her “brother’s wife,” Nozomi-san.\n\n“We might not be blood related, but we’re family.”\nThe story they write is a bit clumsy but full of something inexplicable. Slowly but surely, they happily grow together through their sensitive daily life.", "url": "https://global.manga-up.com/manga/33", "next_update": "Next Update : July 26, 2022", "genres": ["School Life"], "last_ch_name": "Chapter 5", "last_ch_id": 2704},
{"id": "48", "title": "Level 0 Demon King Becomes an Adventurer in Another World", "author": "Shiki MIZUCHI, Sasa Karasuma, Asagi Tosaka", "image": "https://global-img.manga-up.com/ehA/en/manga_main/48.webp?h=t8HHqcV1IORnPyF1Wudngw&e=1659139200", "description": "Ishuto was the strongest Demon Lord in the Dark Continent until he was defeated by the heroes. But instead of dying, he reincarnated into another world as a young man, while still keeping his powers. \"I will start from scratch in this world and this time it'll be mine!\". The elite adventurer Airis was charmed by Ishuto's strength and became his guardian so he could enter the adventurer training school, but due to his otherworldly powers, he graduated the very first day, receiving the unprecedented title of \"level 0\". He's a maverick with Demon Lord powers that has no match in this world...", "url": "https://global.manga-up.com/manga/48", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 12.3", "last_ch_id": 3924},
{"id": "78", "title": "Kuno Chiyo the Psychic", "author": "Seiichi Shiki", "image": "https://global-img.manga-up.com/88r/en/manga_main/78.webp?h=mmJE7uQX6sUiremI9a67Iw&e=1659139200", "description": "Kuno Chiyo, a high school student, has the power to see the future. \nOne day, she learns through a vision that she will marry her fellow classmate, Kishida, who likes her and isn't shy at all about expressing his love for her. \nThis is the story of the two lovebirds and the daily struggle for the easily embarrassed Chiyo to turn down Kishida's advances (both in reality and in her visions) while ignoring her developing feelings...", "url": "https://global.manga-up.com/manga/78", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Chapter 30", "last_ch_id": 5679},
{"id": "157", "title": "Knight's & Magic", "author": "Hisago Amazake-no, Takuji Kato", "image": "https://global-img.manga-up.com/oRa/en/manga_main/157.webp?h=Zdi_wDrMqFDV-I0U_DiBlg&e=1659139200", "description": "A genius programmer and hardcore robot otaku is reborn into a world of knights and magic, where huge robots called Silhouette Knights roar across the land! Now reborn as Ernesti Echavarria, he uses his vast knowledge of machines and programming talents to begin to make his ultimate robot. But his actions have unexpected results...?! The dreams of a robot otaku will change the world!", "url": "https://global.manga-up.com/manga/157", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Final Chapter -2", "last_ch_id": 17277},
{"id": "72", "title": "Killing My Sensei Softly", "author": "Sharoh Hanten", "image": "https://global-img.manga-up.com/X8U/en/manga_main/72.webp?h=rP9CsOJpnnkC2W4rSvsA9g&e=1659139200", "description": "After school, Sensei tutors me in secret. My classmates think we have some sort of relationship, but they've got it all wrong. Sensei is a serial killer, and I am his apprentice.\n \n\"Sensei, please teach me how to murder.\"\n \nA dark love unfolds between a serial killer Sensei and his devoted apprentice!", "url": "https://global.manga-up.com/manga/72", "next_update": "Next Update : July 1, 2022", "genres": ["School Life", "Suspense"], "last_ch_name": "Chapter 1.1", "last_ch_id": 5363},
{"id": "90", "title": "Killer Alchemist -Assassinations in Another World-", "author": "Shinkoshoto, Coin, Akai Tera", "image": "https://global-img.manga-up.com/ORE/en/manga_main/90.webp?h=4Ls8lEpX1Jrxo_TyWsxaNw&e=1659139200", "description": "Late has just accepted an assassination from a strange, mysterious client.\nTo his surprise, it was actually the goddess Mises. A goddess from another world whose exsistence was on the brink of destruction after her defeat in war.\nMises' quest… is to assassinate Masura Dzur, another god in her world.\nLate, the assassin with a 99.9% success rate, was tasked to assassinate a god in another world?!", "url": "https://global.manga-up.com/manga/90", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 11.4", "last_ch_id": 16560},
{"id": "1", "title": "Kijima-san & Yamada-san", "author": "Hoshimi SK", "image": "https://global-img.manga-up.com/ysO/en/manga_main/1.webp?h=pJeOx62XOLqLW-TozomMmg&e=1659139200", "description": "Kijima-san, who became telepathic after an accident, works with Yamada-san, a woman who always has the loudest, most lovey-dovey thoughts. As he spends day after day hearing Yamada-san’s very clear feelings toward him, he starts falling for her bubbly and warm personality...?! Despite knowing both of their feelings, he’s totally unable to make a move. It’s a wholesome rom-com with feelings of love for all to hear!", "url": "https://global.manga-up.com/manga/1", "next_update": "Next Update : July 26, 2022", "genres": [], "last_ch_name": "Chapter 12.3", "last_ch_id": 14970},
{"id": "134", "title": "Kakegurui Twin", "author": "Homura Kawamoto, Kei Saiki", "image": "https://global-img.manga-up.com/OTd/en/manga_main/134.webp?h=vc5NNSVap-KeObezmhcU5Q&e=1659139200", "description": "As a first-year student of the renowned Hyakkaou Private Academy, Mary Saotome knows her future is set for a one-way cruise to the top...\nThat is, until an encounter with an old-classmate-turned-housepet throws the newbie princess into the world of gambling! Can a normal girl like Mary make friends and survive debtless through only wit and luck? Find out in this prequel to the mega-popular Kakegurui!", "url": "https://global.manga-up.com/manga/134", "next_update": "Next Update : July 27, 2022", "genres": ["School Life", "Game"], "last_ch_name": "Chapter Fifty -2", "last_ch_id": 12516},
{"id": "133", "title": "Kakegurui - Compulsive Gambler -", "author": "Homura Kawamoto, Toru Naomura", "image": "https://global-img.manga-up.com/oKW/en/manga_main/133.webp?h=EwN3PSeZc2YlC6-1ZQYpCQ&e=1659139200", "description": "Hyakkaou Private Academy. An institution for the privileged with a very peculiar curriculum. You see, when you're the sons and daughters of the wealthiest of the wealthy, it's not athletic prowess or book smarts that keep you ahead. It's reading your opponent-the art of the deal. What better way to hone those skills than with a rigorous curriculum of gambling?\nAt Hyakkaou Private Academy, the winners live like kings, and the losers are put through the wringer. But when Yumeko Jabami enrolls, she's gonna teach these kids what a high roller really looks like!", "url": "https://global.manga-up.com/manga/133", "next_update": "Next Update : July 26, 2022", "genres": ["School Life", "Game"], "last_ch_name": "Chapter Ninety-Five -1", "last_ch_id": 18294},
{"id": "116", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon? On the Side: Sword Oratoria", "author": "Fujino Omori, Takashi Yagi, Kiyotaka Haimura, Suzuhito Yasuda", "image": "https://global-img.manga-up.com/o9P/en/manga_main/116.webp?h=Ka1q2k_aFL_u7Jjsh6CMdA&e=1659139200", "description": "Aiz Wallenstein is the Sword Princess, one of the best fighters from the most powerful group in all of Orario, Loki Familia . She's consumed by one goal: become stronger. Together with her familia, Aiz departs on quests to some of the deepest floors of the dungeon, exploring and fighting the dangerous monsters born below. But when one expedition goes terribly wrong, will Aiz be strong enough to save her familia, or has all her work been for naught...?", "url": "https://global.manga-up.com/manga/116", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Adventure"], "last_ch_name": "quest70. -2", "last_ch_id": 9737},
{"id": "169", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon? II", "author": "Taisei Yamachi, Fujino Omori, Suzuhito Yasuda", "image": "https://global-img.manga-up.com/8hY/en/manga_main/169.webp?h=nSUgTGu55dQVbs9yPltbUg&e=1659139200", "description": "Adventurer Bell Cranell's life changed forever when he met the goddess Hestia, becoming the first member of her familia. Since then, he’s gone on many adventures, growing much stronger in the process. But when he steps foot into Orario’s pleasure quarter, where Ishtar Familia reigns supreme, he soon finds himself in way over his head... With enemies all around him, he’ll need the help of a beautiful, fox-eared courtesan if he’s to have any hope of making it back home!", "url": "https://global.manga-up.com/manga/169", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "7th Chime -1", "last_ch_id": 15391},
{"id": "118", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon? Four-Panel Comic: Odd Days of Goddess", "author": "Fujino Omori, Masaya Takamura, Suzuhito Yasuda", "image": "https://global-img.manga-up.com/o9m/en/manga_main/118.webp?h=BesoR-qJ_CqD9jqrYEPs1A&e=1659139200", "description": "For the gods and goddesses who give their followers Blessings to dive into the Dungeon, there's nothing they won't do for the sake of their familia. But have you ever wondered how they spend their days while their brave adventurers are busy fighting down below? Get a rare glimpse into the rare and just a tiny bit slapstick daily lives of the deities of Orario, 4-koma style!", "url": "https://global.manga-up.com/manga/118", "next_update": "Next Update : July 1, 2022", "genres": ["Adventure", "Comedy"], "last_ch_name": "Step 16", "last_ch_id": 15517},
{"id": "117", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon? Four-Panel Comic: Days of Goddess", "author": "Fujino Omori, Masaya Takamura, Suzuhito Yasuda", "image": "https://global-img.manga-up.com/OTE/en/manga_main/117.webp?h=z1dN-e9EoRsNyZ9kuX7wyw&e=1659139200", "description": "While adventurers crawl the Dungeon, the gods and goddesses of Orario are always working hard behind the scenes for their beloved children! The deities who remain on the surface might not brave the labyrinth's depths, but they're just as busy--all of them occupied with duties like managing their familia's business, striking deals, gathering information, or going shopping, stuffing their faces, lounging about not doing much of anythi--adventures! So many adventures! Who can really say what happens in the sometimes precious, occasionally chaotic day-to-day lives of this charming pantheon?", "url": "https://global.manga-up.com/manga/117", "next_update": "Next Update : July 25, 2022", "genres": ["Adventure", "Comedy"], "last_ch_name": "Step 14", "last_ch_id": 15371},
{"id": "115", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon? Familia Chronicle Episode Lyu", "author": "Fujino Omori, Hinase Momoyama, nilitsu, Suzuhito Yasuda", "image": "https://global-img.manga-up.com/8gQ/en/manga_main/115.webp?h=9_SiC_60orVfBlmbf-plTg&e=1659139200", "description": "In Orario, the only place in the world that hosts the entrance to the massive subterranean Dungeon, there's a certain tavern where the most desperate and vulnerable bring their troubles. There, the ex-adventurer Lyu Lion uses her terrifying strength to wrest what justice she can from the shadows of the Labyrinth City! But when a girl goes missing and all evidence points toward the powerful Grand Casino, she may need more than brute force to help...!", "url": "https://global.manga-up.com/manga/115", "next_update": "Next Update : July 27, 2022", "genres": ["Action", "Adventure"], "last_ch_name": "Girls.11 -4", "last_ch_id": 9560},
{"id": "114", "title": "Is It Wrong to Try to Pick Up Girls in a Dungeon?", "author": "Fujino Omori, Kunieda, Suzuhito Yasuda", "image": "https://global-img.manga-up.com/o8I/en/manga_main/114.webp?h=hclEGSmjvek1r2ORYxOg2w&e=1659139200", "description": "Bell Cranel is just trying to find his way in the world. Of course, in his case, the \"world\" is an enormous dungeon filled with monsters, below a city run by gods and goddesses who have way too much time on their hands.\n\nHe's got big dreams but not much more when a roll on the random encounter table brings him face-to-face with the girl of his dreams--but what does a beginning adventurer have to offer a brilliant swordswoman? And what if the lonely goddess who sponsors his solo adventuring gets jealous...?!", "url": "https://global.manga-up.com/manga/114", "next_update": "Next Update : July 26, 2022", "genres": ["Action", "Adventure"], "last_ch_name": "STEP 86", "last_ch_id": 9482},
{"id": "98", "title": "Is It My Fault That I Got Bullied?", "author": "Chikara Kimizuka, Yen Hioka", "image": "https://global-img.manga-up.com/8Cc/en/manga_main/98.webp?h=8nrrovndSqNd-ErnGj5B6A&e=1659139200", "description": "Aizawa was relieved that after twenty years, Suzuki hadn't changed.\n\nThe two met again at their school reunion, and his former bully Suzuki was as spiteful as ever. But little did he know, Aizawa was now a middle school teacher. And his beloved daughter is one of his students…", "url": "https://global.manga-up.com/manga/98", "next_update": "Next Update : July 1, 2022", "genres": ["School Life", "Suspense"], "last_ch_name": "Chapter 7.3", "last_ch_id": 7357},
{"id": "63", "title": "In Her Fifth Life, the Villainess Lives With the Evil Dragon -The Evil Dragon of Ruin Wants to Spoil His Bride-", "author": "Rine Shimada, Itsuki Azumaya", "image": "https://global-img.manga-up.com/OLm/en/manga_main/63.webp?h=9m8LlDAk930BUDuipEEevQ&e=1659139200", "description": "The countess, Musee Schnorr, has died four times, with both time and her life rewinding after each death. After her last death, her fifth life begins anew with the betrayal of her fiance. When pushing away the despair of her many tragic ends, someone she encountered during her fourth life comes to mind. He was the only person saddened by her death, and the very one who will destroy the world?The Evil Dragon of Ruin. Now, the curtain rises on Musee and the Evil Dragon’s broken love, along with their sweet revenge.", "url": "https://global.manga-up.com/manga/63", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 20.3", "last_ch_id": 4908},
{"id": "102", "title": "Immoral Guild", "author": "Taichi Kawazoe", "image": "https://global-img.manga-up.com/OS9/en/manga_main/102.webp?h=O71fPzE6zHKZboyBfG6YPw&e=1659139200", "description": "An incompetent martial artist, a crabby white mage, a lazy black mage, and a drunk warrior.\n \nThese four newbie guards confront monsters to protect the peace of their town.\n \nOur heroines continue to be humiliated day after day in this controversial(?) story!", "url": "https://global.manga-up.com/manga/102", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 21.3", "last_ch_id": 7675},
{"id": "39", "title": "I’m the Only Monster Tamer in the World and Was Mistaken for the Demon Lord", "author": "Senri Kakei, Norio Doujima, hu-ko", "image": "https://global-img.manga-up.com/OGN/en/manga_main/39.webp?h=LwSE62MzSPl7fJAGDrXhOA&e=1659139200", "description": "After a long journey, Noa finds the \"Class Change Book.\" He's done to all to abandon his bothersome \"Hero\" role and gain a new class... \"Monster Tamer.\"", "url": "https://global.manga-up.com/manga/39", "next_update": "Next Update : July 25, 2022", "genres": ["Action"], "last_ch_name": "Chapter 21.3", "last_ch_id": 3225},
{"id": "85", "title": "I’m an Alchemist Who Doesn’t Know How OP I Am", "author": "Kaduki Ryo, Yo Toraku, Pesuto Kuroda, Hizuki Miya", "image": "https://global-img.manga-up.com/OP-/en/manga_main/85.webp?h=wbwMZIdCCRnRjhz_wfbp1g&e=1659139200", "description": "In order to save her little sister's life, S-ranked adventurer Laffey seeks an all-healing elixir. However, elixirs are highly precious items that take years to make by even the most experienced of alchemists. But one day, she meets a man that defies these rules!\n\n\"Here, an elixir. Oh it's fine, I can always just make more.\"\n\nA slow-paced fantasy about an extraordinary alchemist who doesn't know his own worth and the beautiful adventurer who gets caught up in his efforts to help others!", "url": "https://global.manga-up.com/manga/85", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 3.2", "last_ch_id": 6226},
{"id": "68", "title": "I'm Not Even an NPC In This Otome Game!", "author": "Gyokuro, Meno Himeno", "image": "https://global-img.manga-up.com/OMq/en/manga_main/68.webp?h=ua-zHm6xVy8kqQS2Z-pqbw&e=1659139200", "description": "Taichi was reincarnated as Isaac, an apprentice gardener in the world of an otome game. But, looking back, Isaac wasn't even part of the game... This is the story of the interweaving lives of the Duke's daughter, Lydia, and a boy who isn't even an NPC.", "url": "https://global.manga-up.com/manga/68", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 18.2", "last_ch_id": 16728},
{"id": "10", "title": "I'm a Maid, but I've Pulled Out the Holy Sword?!", "author": "Midori Akino, Genen（FANFAN COMIC）, Fua Yamasaki", "image": "https://global-img.manga-up.com/OA1/en/manga_main/10.webp?h=WEHb9a8dxGPFtlUmDmr7sw&e=1659139200", "description": "Eleanor, a maid working in the royal palace, accidentally draws the holy sword that had lain dormant for a thousand years.  The sword was said to be a gift from the goddess, meant only for the hero to draw and defeat the Demon Lord.  There’s no real need for a hero in these days, however.  Things are going just fine.  More than that, she’s not looking to lose her job!  The plan is to just put the sword back and sweep this all under the rug, but unfortunately for her, the attractive-yet-brusque prince saw the whole thing.  It’s going to take everything Eleanor has to cover this up?assuming she even can!", "url": "https://global.manga-up.com/manga/10", "next_update": "Next Update : July 26, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 18.3", "last_ch_id": 594},
{"id": "96", "title": "I Time-Traveled and Confessed to Ｍy Teacher Crush", "author": "Kennoji, Komikan Matsumoto, Yasuyuki", "image": "https://global-img.manga-up.com/8C0/en/manga_main/96.webp?h=ZK0AqtnAIeNt-o6kHx5FwA&e=1659139200", "description": "Seiji Sanada, a 30-year-old wage slave, woke up one morning and had time leaped back to the spring of his sophomore year of high school. Seiji, who had long regretted graduating without confessing to his beloved world history teacher, Haruka Hiiragi, resolved that this time, he’d confess to her. Her response was... An astonishing ‘Okay’?!?!?!?! The two of them began discretely dating. It was supposed to be the start of their *vie en rose*... but Hiiragi-sensei is a woman so sweet, she’ll spoil her man rotten!!! A super flirtatious rose-colored school life begins!!!", "url": "https://global.manga-up.com/manga/96", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Chapter 56.3", "last_ch_id": 7277},
{"id": "141", "title": "I Think I'll Cheat to Become a Spellsword in Another World", "author": "Shinkoshoto, Nanora, Itsuki Watanabe, Tomozo", "image": "https://global-img.manga-up.com/O_d/en/manga_main/141.webp?h=jse8pq9j2_ykePp5UBzk_w&e=1659139200", "description": "Suzumiya Kaede has little to look forward to in life aside from online gaming, and even that's slipping away from him. After a three-day-long MMO bender, he passes out and finds himself waking up in an entirely foreign fantasy world full of monsters and magic. Starting out with access to unthinkably powerful skills, he resolves to make the most of the situation and pioneer a hitherto unheard of niche: a spellsword.", "url": "https://global.manga-up.com/manga/141", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 7 -1", "last_ch_id": 12905},
{"id": "65", "title": "I Got Reincarnated as a Son of Innkeepers!", "author": "Renkinou, Asuka Takase, Chaco Abeno", "image": "https://global-img.manga-up.com/OMR/en/manga_main/65.webp?h=oL1IRfSJVn415XbtDmsxKQ&e=1659139200", "description": "In modern-day Japan, Yadoya Kenta is the typical overworked employee of a black company. It’s to no surprise when he dies from overwork one day, but when he wakes up, he finds himself as the Hero o-... Wait, that’s not it. Uh… he finds himself reincarnated as Tory, the son of two innkeepers in the fantasy town of Rubella!\n\nThis time, Tory will make sure that he lives a leisurely life where he only works in moderation! Surrounded by a kind family and lively customers, he aims to enjoy a relaxed, slow-paced lifestyle as the son of innkeepers!\n\nThis is a fantasy of a relaxed work life!", "url": "https://global.manga-up.com/manga/65", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 19.1", "last_ch_id": 16740},
{"id": "25", "title": "I Lost My Adventurer's License, but It's Fine Because I Have an Adorable Daughter Now", "author": "Manimani Ononata, Fumi Tadaura, Itsuki Watanabe, Fuzichoco", "image": "https://global-img.manga-up.com/ODr/en/manga_main/25.webp?h=eDRGHgwrQx1G87ByJk7-1g&e=1659139200", "description": "Douglas, once known as a legendary enhancement spellcaster, is now little more than your average, weak old man. On top of that, he was kicked out of the hero party, and eventually had his adventurer's license revoked... And that's how he ended up a vagabond, wandering aimlessly. After an encounter with Rabi, a cursed little girl, a new adventure begins...", "url": "https://global.manga-up.com/manga/25", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 19.2", "last_ch_id": 1824},
{"id": "34", "title": "I Got Pregnant With His Majesty's Child -A Biography of Queen Berta-", "author": "Himawari Nishino, Aya Tanaka", "image": "https://global-img.manga-up.com/84Z/en/manga_main/34.webp?h=THFF0aMO37vAAerd44qZ2g&e=1659139200", "description": "Berta is wed to the king as his second wife in a loveless, political marriage. However, after Berta falls pregnant with his child, the royal palace is thrown into disarray. The king's first wife stews in jealousy and a deep-seated sense of betrayal as Berta and King Harold's relationship begins to change.", "url": "https://global.manga-up.com/manga/34", "next_update": "Next Update : July 1, 2022", "genres": [], "last_ch_name": "Chapter 12.4", "last_ch_id": 2854},
{"id": "136", "title": "I Became a Legend after My 10 Year-Long Last Stand", "author": "Ezogingitune, Chaco Abeno, DeeCHA, Kitsune Tennoji", "image": "https://global-img.manga-up.com/O-4/en/manga_main/136.webp?h=3Yq_ZzfJHBD5AV2knP6PFA&e=1659139200", "description": "With no other options, Luck makes the choice to hold the line against the unending demonic hordes alone, to make sure his comrades can escape with their lives. However, through a combination of fortune, skill, and ingenuity, he holds that line for ten straight years, eventually coming out on top singlehandedly. Now he has to tackle the dilemma of how to occupy himself in a world where he holds a myriad of roles: that of a legend, that of a veteran, and that of a brand new face.", "url": "https://global.manga-up.com/manga/136", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 5 -2", "last_ch_id": 12572},
{"id": "17", "title": "How to Survive a Thousand Deaths: Accidentally Wooing Everyone as an Ex-gamer Made Villainess!", "author": "Arata Shiraishi, CHIHIRO", "image": "https://global-img.manga-up.com/cXd/en/manga_main/17.webp?h=nRTowi470lXkEi1l7m6cZg&e=1659139200", "description": "Grimoire Alchemist is a dating sim popular among both boys and girls in Japan. The player’s rival in love, Claudia Ellington, is jokingly called the “Villainess of a Thousand Deaths.” But this alias of hers is actually no joke; she really does die a thousand times in the game!\n\nAlas, our poor little protagonist ends up filling Claudia’s shoes when she gets reincarnated in the world of Grimoire Alchemist. Determined to escape the dire fate she has in store for her, Diehard Grimoire Alchemist Fan #1 (now the reincarnated Claudia) does everything she can to avoid entering the love interests’ romance routes in an attempt to separate herself from the game’s storyline and save her own skin. Despite her best efforts, she fails spectacularly as her love for the characters and game compendium of a brain lead to her pulling off impressive feats one after another.\n\nJoin her as she (much to her dismay) magnificently steals the hearts of the game's charming love interests!", "url": "https://global.manga-up.com/manga/17", "next_update": "Next Update : July 26, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 8.3", "last_ch_id": 1018},
{"id": "5", "title": "How I Attended an All-Guy's Mixer", "author": "Nana Aokawa", "image": "https://global-img.manga-up.com/__h/en/manga_main/5.webp?h=4KN-60NDHbLEP8lmuPPb8w&e=1659139200", "description": "College student Tokiwa gets invited to a mixer by his female classmate Suo. But when he arrives with his friends, they’re greeted by three dazzlingly handsome men?!", "url": "https://global.manga-up.com/manga/5", "next_update": "Next Update : July 25, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 20", "last_ch_id": 16018},
{"id": "44", "title": "How a Single Gold Coin Can Change an Adventurer's Life", "author": "Hazama Amano, Sato Tsukishima, Kazutomo Miya", "image": "https://global-img.manga-up.com/OHK/en/manga_main/44.webp?h=pYIcEocvkkcsY0jywgd1Zw&e=1659139200", "description": "Wannabe adventurer Istolfa dreams of becoming a first-class adventurer and earns a small amount of money by collecting herbs, but no matter what he does, he is unable to escape from life on the streets.\n \nOne day he runs into the light elf Stella, who...gives him one single gold coin?! No tricks! No reincarnation!\n \nThis is the beginning of a traditional fantasy story where a normal boy challenges a dungeon to fulfill his dreams! ", "url": "https://global.manga-up.com/manga/44", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 12.2", "last_ch_id": 3715},
{"id": "122", "title": "Horimiya", "author": "HERO, Daisuke Hagiwara", "image": "https://global-img.manga-up.com/oDj/en/manga_main/122.webp?h=CNR11M4QGgwZYi90IDTE6Q&e=1659139200", "description": "At school, Kyouko Hori is known for being smart, attractive, and popular. On the other hand, her classmate, the boring, gloomy Izumi Miyamura tends to get painted as a \"loser fanboy.\" But when a liberally pierced and tattooed (not to mention downright gorgeous) Miyamura appears unexpectedly on the doorstep of secretly plain-Jane homebody Hori, these two similarly dissimilar teenagers discover that there are multiple sides to every story...and person!", "url": "https://global.manga-up.com/manga/122", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "page･118 -2", "last_ch_id": 10398},
{"id": "84", "title": "Homeland Dropout: The Time I Was Reincarnated as the Fourth Enchanter in the Entire \nWorld", "author": "Shizuku Mikage, HAYADAI", "image": "https://global-img.manga-up.com/XAB/en/manga_main/84.webp?h=NcZva5Bw6SPff_fjF4EYxQ&e=1659139200", "description": "He only just got reincarnated in another world as Zinc, a dropout noble, but he’s immediately banished from the kingdom?! However, that’s not enough to make Zinc just give up! With “Enchantment,” a power that can make anyone stronger by granting abilities to items, Zinc wants to make a life for himself as an adventurer. The curtain draws on Zinc’s journey as he uses this incredibly rare ability, that’s basically a cheat code, to go from zero to hero!", "url": "https://global.manga-up.com/manga/84", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 10.3", "last_ch_id": 6215},
{"id": "142", "title": "Hero Classroom", "author": "Shin Araki, Koara Kishida, Haruyuki Morisawa", "image": "https://global-img.manga-up.com/O_u/en/manga_main/142.webp?h=PeH-P5FKCKAF_YEQb7Y7EQ&e=1659139200", "description": "Blade is a carefree transfer student whose only goal is to make friends with his classmates at Rosewood Academy, a school for heroes-in-training. On the surface, Blade seems like an ordinary boy, but he is hiding a miserable secret with seeds that start long ago, with the defeat of the Demon King at the hands of the Great Hero. Join this new class of friends as they unravel the mystery surrounding Blade, and journey toward becoming full-fledged Heroes!", "url": "https://global.manga-up.com/manga/142", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "School Life"], "last_ch_name": "Chapter 4.3", "last_ch_id": 12977},
{"id": "121", "title": "Hinowa ga CRUSH!", "author": "Takahiro, strelka", "image": "https://global-img.manga-up.com/oDV/en/manga_main/121.webp?h=PQEFn2yrw76Ghd2NUnmMgA&e=1659139200", "description": "On the island of Wakoku, the civil war offers anyone the chance of becoming a hero -- from fishing women to bastard children, any can make a name for themselves by working through the rigorous ranks of the army. Hinowa, a young woman with extraordinary skills, is determined to do just that, but soon learns things may not always go to plan...More than ten years after a disastrous battle, the war is still ongoing, and a girl with black hair and black markings washes up on shore...\nFrom the writer behind Akame ga KILL! comes a brand new series!", "url": "https://global.manga-up.com/manga/121", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 53 -2", "last_ch_id": 17673},
{"id": "137", "title": "Goodbye, Eden", "author": "Zero Ainan", "image": "https://global-img.manga-up.com/Ozx/en/manga_main/137.webp?h=Eg72HzgZ4VwVZaHq9VJDaw&e=1659139200", "description": "In the middle of a long war, scientists invented a drug that transforms the fear of death into pleasure, making it possible for school girls to fight alongside men. In this world of death, drugs, and rampant sex, one girl still dreams of true love. Will she find her romantic, happy ending?", "url": "https://global.manga-up.com/manga/137", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "School Life"], "last_ch_name": "Chapter 10 -1", "last_ch_id": 12689},
{"id": "109", "title": "Goblin Slayer: Brand New Day", "author": "Kumo Kagyu, Masahiro Ikeno, Noboru Kannatuki", "image": "https://global-img.manga-up.com/o4Z/en/manga_main/109.webp?h=PAXo7Cd8T-L9UPnZmGL0mA&e=1659139200", "description": "In a remote town dwells a man single-mindedly devoted to the slaughter of goblins-a man known as Goblin Slayer. However, this grim crusader isn't the only one living an adventure-filled life! There are many who cross his path, like the rookie warrior and apprentice cleric who (though a bit put off by him) seek out Goblin Slayer's advice. Or the waitress on a mission to get him to eat her tavern's food...Not to mention the goblins themselves, lying in wait in their nest. They all have their own stories to tell!", "url": "https://global.manga-up.com/manga/109", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Dark Fantasy"], "last_ch_name": "Chapter 10 -4", "last_ch_id": 8864},
{"id": "110", "title": "Goblin Slayer Side Story: Year One", "author": "Kumo Kagyu, Kento Sakaeda, Shingo Adachi, Noboru Kannatuki", "image": "https://global-img.manga-up.com/o4m/en/manga_main/110.webp?h=3csSXxHFUNfICNx8FYmbjg&e=1659139200", "description": "Three days after his sister's death, he finally regained the will to move. In the aftermath of a goblin raid, a lone boy mourns the loss of his village, his family...\n\nFive years later, that same boy visits a city on the frontier and becomes an adventurer.\n\nDespite being the lowest rank and wholly inexperienced, the young adventurer immediately accepts a quest and sets out alone to raid a goblin lair. His mind already burning with a clear vision of his calling, the legend of Goblin Slayer begins!", "url": "https://global.manga-up.com/manga/110", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Dark Fantasy"], "last_ch_name": "Chapter 74", "last_ch_id": 17802},
{"id": "111", "title": "Goblin Slayer Side Story II: Dai Katana", "author": "Kumo Kagyu, Shogo Aoki, lack", "image": "https://global-img.manga-up.com/o5Z/en/manga_main/111.webp?h=MgAFny1-wOf3Qw6JqZSxAw&e=1659139200", "description": "The impregnable Dungeon of the Dead lies in the farthest north, spewing the Death from its gaping maw, a plague of devastation and undeath that has spread throughout the Four-Cornered World. Nothing but certain doom has awaited those who descend to its deepest level in hopes of finding the source of this pestilence?at least, not until that challenge is met by a certain party of adventurers, six men and women who would one day be called heroes...With this volume, the ashen tale of the legends of Goblin Slayer's world begins!", "url": "https://global.manga-up.com/manga/111", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Dark Fantasy"], "last_ch_name": "Chapter 10 -4", "last_ch_id": 9019},
{"id": "108", "title": "Goblin Slayer", "author": "Kumo Kagyu, Kousuke Kurose, Noboru Kannatuki", "image": "https://global-img.manga-up.com/o45/en/manga_main/108.webp?h=ux9kCIP4NJOHbVox1SN7uA&e=1659139200", "description": "A young priestess joins her first adventuring party but almost immediately encounters the most unspeakable horrors. Rescued by an enigmatic warrior called Goblin Slayer, she partners with her savior on his mission to exterminate all goblins-by any means necessary. When rumors of Goblin Slayer's feats begin circulating, there's no telling who might come calling next...", "url": "https://global.manga-up.com/manga/108", "next_update": "Next Update : July 25, 2022", "genres": ["Action", "Dark Fantasy"], "last_ch_name": "Chapter 72", "last_ch_id": 17793},
{"id": "126", "title": "Fullmetal Alchemist", "author": "Hiromu Arakawa", "image": "https://global-img.manga-up.com/oFZ/en/manga_main/126.webp?h=-M1uInQXBmsmUzWIHGfrug&e=1659139200", "description": "Alchemy: the mystical power to alter the natural world; something between magic, art, and science. When two brothers, Edward and Alphonse Elric, dabbled in this power to grant their dearest wish, one of them lost an arm and a leg...and the other became nothing but a soul locked into a body of living steel. Now Edward is a agent of the government, a slave of the military-alchemical complex, using his unique powers to obey orders...even to kill. Except his powers aren't unique. The world has been ravaged by the abuse of alchemy. And in the pursuit of the ultimate alchemical treasure, the Philosopher's Stone, their enemies are even more ruthless than they are..", "url": "https://global.manga-up.com/manga/126", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Side Story", "last_ch_id": 11045},
{"id": "155", "title": "From Overshadowed to Overpowered: Second Reincarnation of a Talentless Sage", "author": "Arata Shiraishi, Kentarou, Uodenim", "image": "https://global-img.manga-up.com/P3a/en/manga_main/155.webp?h=JhM9kEWzdXgvU_qpcvIcmw&e=1659139200", "description": "The Sage of Wind, Ephtal is a reincarnated human, coming from modern Earth. Reincarnated in a new world where magic is real, he decides to devote the entirety of his life in the pursuit of magic. Despite his efforts, though, he discovers that he is absolutely talentless in magic, and breathed his last in anguish.\n...But it isn’t the end for him just yet! He reincarnates once again bearing the same name, Ephtal, 400 years later. Having retained his knowledge and power, he steels his resolve and once again sets his sights for the peak of magic!\nHowever, in a surprising turn of events, he discovers that magic has terribly declined. In this era where powerful spells is a rarity, his talentless self is now completely unmatched!\nFrom the depths of powerlessness to the peak of power, the talentless but peerless mage's journey to the top starts now!", "url": "https://global.manga-up.com/manga/155", "next_update": "Next Update : July 25, 2022", "genres": ["Action", "School Life"], "last_ch_name": "Chapter 6 -4", "last_ch_id": 13938},
{"id": "31", "title": "From Leveling Up the Hero to Leveling Up a Nation", "author": "kuro-ouji, Yoshiyuki Takahashi, teffish", "image": "https://global-img.manga-up.com/6d/en/manga_main/31.webp?h=XEdDsS9opkEU5lgBW1IO_A&e=1659139200", "description": "With the hero's party having grown past the need for his training skills, the protagonist Aega finds himself sacked. In lieu of a cash severance pay, he's granted dominion over the territory of Tokumo. However, his new domain may hide a shocking secret...!", "url": "https://global.manga-up.com/manga/31", "next_update": "Next Update : July 27, 2022", "genres": [], "last_ch_name": "Chapter 22.3", "last_ch_id": 16982},
{"id": "83", "title": "From Betrayed Hero to Invincible Demon King", "author": "Sai Sumimori, jimmy, Masayumi", "image": "https://global-img.manga-up.com/8AU/en/manga_main/83.webp?h=Cah34W-JMcQR43O9OLgy6g&e=1659139200", "description": "Despite being called ugly and detested for his looks, Galius was the hero who lived for the sake of mankind.\nHowever, the humans betrayed Galius. So, he too, forsook the humans. Then, after experiencing the warmth of the demon kind, he decides to help the demons in building their paradise!!!\n\nBy using the strongest power given to him by God, this is the ultimate isekai fantasy of a man - the Hero - who becomes the strongest, unconquerable Demon King!", "url": "https://global.manga-up.com/manga/83", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 19", "last_ch_id": 6162},
{"id": "156", "title": "Final Fantasy Lost Strange", "author": "Hazuki Minase, Itsuki Kameya", "image": "https://global-img.manga-up.com/oR6/en/manga_main/156.webp?h=rBx3Z5n3I2rgzJhw5HGdrQ&e=1659139200", "description": "Square Enix employee Shogo Sasaki has a big dream-to produce his very own Final Fantasy game with his sister, Yuko. But after the siblings are involved in a truck accident, they awaken to realize they've left their world behind...and fallen into the world of Final Fantasy! After coming to grips with the situation, they meet some new friends, join a party, and accept their fate as adventurers. But when danger approaches, Shogo will discover that his encyclopedic knowledge of the games can only take him so far...", "url": "https://global.manga-up.com/manga/156", "next_update": "Next Update : July 25, 2022", "genres": ["Adventure", "Game"], "last_ch_name": "Chapter42 -1", "last_ch_id": 17259},
{"id": "58", "title": "Final Boss Fake-out: The Protagonist Thinks He Killed Me So Now I'm Free!", "author": "Mochimaru Sakaki, Namiki Tsukiyama, Tajimaryuushi", "image": "https://global-img.manga-up.com/87N/en/manga_main/58.webp?h=kY308hWLloptlJlUV2BZUg&e=1659139200", "description": "The strongest final boss in RPG history figures out a way to get super rich in his own world!\n\nDemon Lord Menas, ruler of the Noa Empire, finds the Resistance's forces on his doorstep. While Alex, a determined, beautiful, blonde young lady stands before him, he gets this weird feeling of deja vu... Isn't this just like the prologue of 'ResNoa', the video game he plays in his dreams?! Menas realizes that he was the final boss of his own world all along! He fakes his death at the hands of Alex and seizes his chance at a brand new life with both hands.\n\nOur dark hero takes his world by storm, using whatever cheat codes he has to protect his newfound freedom!", "url": "https://global.manga-up.com/manga/58", "next_update": "Next Update : July 25, 2022", "genres": ["Action"], "last_ch_name": "Chapter 12.3", "last_ch_id": 16796},
{"id": "139", "title": "Fenrir", "author": "Chugaku Akamatsu, Mioko Ohnishi", "image": "https://global-img.manga-up.com/O-x/en/manga_main/139.webp?h=9HN0ZxaueiwLFX3nawgrRw&e=1659139200", "description": "Somewhere among the violent and chaotic grasslands of 12th century Mongolia, lives a boy named Temujin. One day, while on the brink of death, he has a fated encounter with a beautiful and mysterious woman that will affect history. This is the story of a boy who will shake the earth.", "url": "https://global.manga-up.com/manga/139", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 17 -2", "last_ch_id": 12773},
{"id": "93", "title": "Emperor's Mark to Rule the Monsters: Reborn Sage to Strongest Adventurer", "author": "Hajime Naehara, DieepZee, BBBOX, Moto Nakamura", "image": "https://global-img.manga-up.com/8BO/en/manga_main/93.webp?h=NBycmjQVqDhF3Ub8F9taqA&e=1659139200", "description": "Emperor Ludis suffered an unjustified death because of his Emperor’s Mark, which allowed him to make servants out of monsters. But instead of dying for good, he reincarnated a thousand years into the future. His previous life gave him no freedom, so this time, he’ll take it all and travel the world as an adventurer!\nBut although he pretends to be normal, he gathers servants again and becomes the strongest adventurer!\nCome see what adventures await Ludis in this monster-filled isekai fantasy!", "url": "https://global.manga-up.com/manga/93", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 17.2", "last_ch_id": 6966},
{"id": "73", "title": "Eighteen", "author": "Satsuki Yoshino", "image": "https://global-img.manga-up.com/eiI/en/manga_main/73.webp?h=onZMEChek0oizhtlIRCgvQ&e=1659139200", "description": "Due to his dad’s flighty tendencies, Kyoichi has been constantly moving from one place to the next his entire life, never even getting the chance to make a friend. The latest move takes him to a peaceful rural town, where he intends to live quietly and not stand out until he graduates. But that plan is quickly interrupted by his oddball classmate Leo, who pulls Kyoichi into his chaotic antics and his circle of friends!", "url": "https://global.manga-up.com/manga/73", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 19.3", "last_ch_id": 15939},
{"id": "71", "title": "Dualing Fighters", "author": "Shinkoshoto, sanorin", "image": "https://global-img.manga-up.com/88q/en/manga_main/71.webp?h=Pgig7Wfw3-XGXfIdBCE65w&e=1659139200", "description": "The world is on the brink of extinction due to an ever-expanding disaster called the \"Eternal Storm.\" However, humanity has a new source of hope in this dying world: weapons which grant power beyond human understanding--the Ability Armaments. Two boys destined to inspire awe with their splendor set out on a journey. Ability Armaments in hand, they won't stop until the world is saved!", "url": "https://global.manga-up.com/manga/71", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 14.3", "last_ch_id": 17074},
{"id": "49", "title": "Drunken D-Rank Pulls Out the Legendary Sword", "author": "Shichio Kuzu, Atsushi Haruki, Heiro", "image": "https://global-img.manga-up.com/OIu/en/manga_main/49.webp?h=Pn-Y2R12K31n5C7bUbR-yg&e=1659139200", "description": "One day, a forever D-rank middle-aged adventurer, Lucas, pulled out the legendary Holy Sword in a drunken stupor and became the strongest! Ever since that day, Lucas’ fate was greatly changed forever. Seeking love and to sate his desires, the reborn middle-aged adventurer's real adventure starts now!", "url": "https://global.manga-up.com/manga/49", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 36.3", "last_ch_id": 16853},
{"id": "40", "title": "Demoted to a Teacher, the Strongest Sage Raises an Unbeatable Class", "author": "Ichi Suzumori., Monika Kaname", "image": "https://global-img.manga-up.com/cYT/en/manga_main/40.webp?h=X6OXC0q3bPWYHMHfxkHHiA&e=1659139200", "description": "Monsters have long threatened humanity’s existence. To fight against these beings, Keith, the youngest person to ever become a sage, joins a knight order and shows immense success on the battlefield. However, that doesn’t last long, as a quarrel with an incompetent higher-up gets him fired from the order. With nowhere to go, Keith is assigned as a teacher, and with his talent for bringing out the best in his students, his class is about to reach unbelievable heights...", "url": "https://global.manga-up.com/manga/40", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "School Life"], "last_ch_name": "Chapter 1.2", "last_ch_id": 3290},
{"id": "119", "title": "Dead Mount Death Play", "author": "Ryohgo Narita, Shinta Fujimoto", "image": "https://global-img.manga-up.com/oC2/en/manga_main/119.webp?h=Ew79-RMmHPIIJHd8dI1CMg&e=1659139200", "description": "It's a showdown for the ages as the legendary hero takes on the corpse god necromancer, but when the dust settles, something isn't quite right... In the final moments of their epic confrontation, the corpse god's final gambit shot was wholly unexpected -- reincarnation magic! Across space and time, a boy named Polka Shinoyama awakens feeling...not quite himself...... Who could've expected that the climactic battle between good and evil would turn out like this??", "url": "https://global.manga-up.com/manga/119", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Suspense"], "last_ch_name": "#86 -2", "last_ch_id": 17814},
{"id": "168", "title": "Daemons of The Shadow Realm", "author": "Hiromu Arakawa", "image": "https://global-img.manga-up.com/oUV/en/manga_main/168.webp?h=8NcXGZypt0sVdwTEihww2Q&e=1659139200", "description": "In a world where certain humans command mighty supernatural duos called Daemons, it is the birthright of \"the children who sunder day and night\"—twins Yuru and Asa—to rule over these powerful entities.\nSeparated from a young age and unaware of the truth of their birth, brother and sister must fight to make their way back to each other, claim their birthright, and save the world...", "url": "https://global.manga-up.com/manga/168", "next_update": "Next Update : July 1, 2022", "genres": ["Action"], "last_ch_name": "Chapter 6-2", "last_ch_id": 18240},
{"id": "148", "title": "Bottom-tier Character Tomozaki", "author": "Yuki Yaku, Fly, Eight Chida", "image": "https://global-img.manga-up.com/P1a/en/manga_main/148.webp?h=eXjbs9LERcvhBvuhoyoO2A&e=1659139200", "description": "With the username \"nanashi,\" Fumiya Tomozaki is the number one player in Japan in the online game \"Attack Family,\" also known as \"Tackfam.\" Despite having such a prestigious title, he struggles in high school due to a lack of social skills. He blames the perplexing mechanics and unjust rules of life for his lack of friends, forcing him to give up and consider himself the lowest-tier character in the \"game.\"\nFumiya was surprised to learn the identity of the number two Tackfam player after a fateful encounter - a popular, clever, and outgoing female classmate of his, Aoi Hinami. Aoi was taken aback to learn that the inept Fumiya was behind the username \"nanashi,\" and she became determined to assist him in winning the \"greatest game of all.\" With Aoi's help, Fumiya begins to progress in the wonderful \"game of life\" by overcoming the harsh challenges of social interaction and human relationships.", "url": "https://global.manga-up.com/manga/148", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Playing Guide 06. -3", "last_ch_id": 13514},
{"id": "76", "title": "Born with the Weakest Job, I Worked My Hardest to Become the Strongest Tamer with the Weakest Skill: Fist Punch!", "author": "Ryuta Kijima, Kana Nakaya", "image": "https://global-img.manga-up.com/gbv/en/manga_main/76.webp?h=KRPRjOrI6VVYaMh_dG8vGg&e=1659139200", "description": "In this world, all humans are born with a Job, a set of skills, and a base Status. However, our protagonist, John Leetle received the short end of the stick and was born with the Tamer Job and blessed with only one skill: Forefist Punch; Both are considered to be the most useless blessings one could receive.\nOne day, by sheer coincidence, he manages to tame a baby Fenrir he found out in the woods, and names it Ferryl. Having made his first friend, things were finally looking up for him. However, it appears Misfortune still haunts him closely, as a grim fate befalls his friend...", "url": "https://global.manga-up.com/manga/76", "next_update": "Next Update : July 26, 2022", "genres": ["Action"], "last_ch_name": "Chapter 11.1", "last_ch_id": 16672},
{"id": "18", "title": "Birdcage Castle", "author": "Toutaro Minami", "image": "https://global-img.manga-up.com/OC3/en/manga_main/18.webp?h=GWYazVc_HEQysOcvjSikFA&e=1659139200", "description": "Three guys and three girls enter a dilapidated amusement park in the hope of finding their missing friend. The Birdcage Castle is supposed to be abandoned... But now they find themselves locked inside and chained together. They'll have to work together to escape in pairs, or they won't escape at all!", "url": "https://global.manga-up.com/manga/18", "next_update": "Next Update : July 26, 2022", "genres": ["Dark Fantasy", "Suspense"], "last_ch_name": "Chapter 11.2", "last_ch_id": 1123},
{"id": "120", "title": "Barakamon", "author": "Satsuki Yoshino", "image": "https://global-img.manga-up.com/oCM/en/manga_main/120.webp?h=PApS2NY3djQLmzbyYIaDEQ&e=1659139200", "description": "For a certain reason, a handsome, young calligrapher by the name of Seishuu Handa uproots himself and moves to an island on the westernmost edge of Japan. \"Sensei,\" as he comes to be known, is a city boy through and through, and has never experienced rural life until now. And by the looks of it, he has much to learn! Luckily(?), he has a willing teacher in Naru, the energetic expert islander, to help show him the ropes. But can Sensei keep up with the plucky first-grader, or will he get schooled?! Here unfolds a heartfelt island comedy about a gruff on the outside, soft on the inside urbanite teacher and his new, unfailingly kind island neighbors!", "url": "https://global.manga-up.com/manga/120", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Act.134 -3", "last_ch_id": 10104},
{"id": "56", "title": "Assistant Teacher at a Girls Magic Academy", "author": "Go Todo, Saori Toyota, Sakura Fujimoto", "image": "https://global-img.manga-up.com/87H/en/manga_main/56.webp?h=_5Tapd16dND9GUQZBMcdTA&e=1659139200", "description": "This series does not intend to promote Satanism.\n\nLou Brandel is a magician who possesses talents that can only be found in one person every few thousand years. One day, he saves the beautiful and noble young woman, Fran. As the principal of Magical Girls Academy, she appoints him to work there with her! His \"interesting\" life of being a powerful magician teacher now begins!", "url": "https://global.manga-up.com/manga/56", "next_update": "Next Update : July 1, 2022", "genres": ["School Life"], "last_ch_name": "Chapter 11.3", "last_ch_id": 4399},
{"id": "151", "title": "Asahina Wakaba & Her Chubby-Chubby Boyfriend", "author": "Takashi Hazama, Momomochi, Hige", "image": "https://global-img.manga-up.com/P1-/en/manga_main/151.webp?h=EdSPFDXgXuNq43-hm5aCfw&e=1659139200", "description": "A clumsy romantically inexperienced teenage girl, Asahina Wakaba, is the most hated girl at her school. Wakaba gets bullied into asking out the school’s biggest Otaku, Iruma Haruto. However, this changed her pitch-black high school years into the ultimate young-love experience.", "url": "https://global.manga-up.com/manga/151", "next_update": "Next Update : July 27, 2022", "genres": ["School Life"], "last_ch_name": "Chapter 4 -1", "last_ch_id": 13733},
{"id": "74", "title": "Are You Okay with a Slightly Older Girlfriend?", "author": "Kota Nozomi, Enya Uraki, Meruchi Nanase", "image": "https://global-img.manga-up.com/ONv/en/manga_main/74.webp?h=CkUuF5Pn9sKmkC0tOvNpbg&e=1659139200", "description": "A high school boy, Kaoru Momota, saved a high school girl named Hime Orihara as she was getting molested on the train one day.\nThe two of them fell in love with each other, but she has a secret that she can't tell anyone.\n\"I'm...actually 27 years old.\" \nThe high school girl actually turned out to be a 27-year-old woman! ", "url": "https://global.manga-up.com/manga/74", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 18.3", "last_ch_id": 5527},
{"id": "54", "title": "Always Second but Actually Invincible", "author": "Azane, ZEN, Daiji", "image": "https://global-img.manga-up.com/X7s/en/manga_main/54.webp?h=r9OAYTfH6oppth5JVuZHvA&e=1659139200", "description": "Cleo Farshid has been disowned from his noble family due to his inability to be number one in anything at the Royal Academy. Cleo decides to escape his stuffy life and live more freely, taking advantage of his skills to become an adventurer. Neither he or his father have realized how amazing it is to be ranked as second in everything at a school where the most talented compete. \n\n\"I'm just an average person. I'm not an expert in anything.\" That sentiment kicks off an unmatched tale about a boy who is the strongest specifically because he's always second!", "url": "https://global.manga-up.com/manga/54", "next_update": "Next Update : July 25, 2022", "genres": [], "last_ch_name": "Chapter 10.2", "last_ch_id": 16804},
{"id": "105", "title": "Akame ga KILL! ZERO", "author": "Takahiro, Kei Toru", "image": "https://global-img.manga-up.com/o12/en/manga_main/105.webp?h=HfNexCrCBWW3u0fM193oSQ&e=1659139200", "description": "They believed that every time they took a life, they brought happiness to another...\n\nBefore becoming Night Raid's deadliest ally, Akame was a young girl bought by the Empire and raised as an assassin whose sole purpose was to slaughter everything in her path. Because that's what makes people happy...right?\n\nDiscover Akame's shocking past in Akame ga KILL! Zero, the prequel to the hit series Akame ga KILL!", "url": "https://global.manga-up.com/manga/105", "next_update": "Next Update : July 25, 2022", "genres": ["Action", "Dark Fantasy"], "last_ch_name": "Final Chapter -3", "last_ch_id": 8174},
{"id": "106", "title": "Akame ga KILL!", "author": "Takahiro, Tetsuya Tashiro", "image": "https://global-img.manga-up.com/o2y/en/manga_main/106.webp?h=rXMThdeCU7E0mTDm8Ljt6A&e=1659139200", "description": "Teenage country bumpkin Tatsumi dreams of earning enough money for his impoverished village by working in the Capital--but his short-lived plans go awry when he's robbed by a buxom beauty upon arrival! Penniless, Tatsumi is taken in by the lovely Miss Aria, but just when his Capital dreams seem in reach yet again, Miss Aria's mansion is besieged by Night Raid--a team of ruthless assassins who targets high-ranking members of the upper class! As Tatsumi is quick to learn, appearances can be deceiving in the Capital, and this team of assassins just might be...the good guys?!", "url": "https://global.manga-up.com/manga/106", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Dark Fantasy"], "last_ch_name": "Final Chapter -4", "last_ch_id": 8373},
{"id": "135", "title": "After-school Hanako-kun", "author": "AidaIro", "image": "https://global-img.manga-up.com/8gf/en/manga_main/135.webp?h=MVx5bU96JiaD8s-xXn4vgw&e=1659139200", "description": "The ghostly Hanako-kun and his mortal assistant, Nene Yashiro, usually have their hands full resolving various supernatural incidents in Kamome Academy, but how do they spend their time when they get a break from all that? Come and watch the characters of Toilet-bound Hanako-kun play games, get sick, change genders, and discover world-shaking secrets during their laid-back after-school hours.", "url": "https://global.manga-up.com/manga/135", "next_update": "Next Update : July 1, 2022", "genres": ["Comedy", "School Life"], "last_ch_name": "Day 15", "last_ch_id": 15854},
{"id": "35", "title": "A Delinquent's Life Hacks", "author": "Otsuji", "image": "https://global-img.manga-up.com/84c/en/manga_main/35.webp?h=9Xbgru2i32R--vT53K25RQ&e=1659139200", "description": "Sakurai-san, who looks like a delinquent, is the type of person to give short advice as he passes by. Although people tend to be intimidated by him at first, his warm heart and thoughtful advice quickly make his friend circle grow. He is kind, caring, knowledgeable, and even athletic! While ticking all the boxes of what a delinquent should look like, and with a huge gap between his looks and personality, Sakurai-san is ready to make someone’s day a little brighter with some advice!", "url": "https://global.manga-up.com/manga/35", "next_update": "Next Update : July 25, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 83", "last_ch_id": 16967},
{"id": "86", "title": "A Dating Sim of Life or Death", "author": "Waruiotoko, Friendly Land, Yunagi", "image": "https://global-img.manga-up.com/OQN/en/manga_main/86.webp?h=YVmwyekyBE4QPWNmORKWXA&e=1659139200", "description": "\"Conquer\" all the ladies! A sexy and exciting suspense-thriller series! A young man awakes to find that his life has become a video game, and one that he must either win or die. Given the cryptic goal of \"conquering\" all the female targets, and no guidance of how to do so, he'll have to rely on the game's systems to untangle the web of violence and intrigue he's found himself trapped in.", "url": "https://global.manga-up.com/manga/86", "next_update": "Next Update : July 1, 2022", "genres": ["Action", "Suspense"], "last_ch_name": "Chapter 2.2", "last_ch_id": 6288},
{"id": "67", "title": "Demon and Song", "author": "Makoto Morishita", "image": "https://global-img.manga-up.com/88P/en/manga_main/67.webp?h=FKjj-8SC22p-CQoV6SSHgQ&e=1659139200", "description": "A tone-deaf boy named Shoddy has been kicked out of the Children's Choir. Yet, in a strange turn of events, he gets taken in by Mister Demon, who becomes his vocal coach.\nThere's just one problem... Shoddy's songs are meant to kill demons! But despite this unlikely duo, their innocent laughter can still be heard every night from the ruins of an abandoned church.", "url": "https://global.manga-up.com/manga/67", "next_update": "Next Update : July 27, 2022", "genres": ["Comedy"], "last_ch_name": "Chapter 12.4", "last_ch_id": 7521}
]